zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MACSEC.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_MACSEC.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_MACSEC
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_MACSEC_H_)  /* Check if memory map has not been already included */
#define S32K566_MACSEC_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- MACSEC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MACSEC_Peripheral_Access_Layer MACSEC Peripheral Access Layer
 * @{
 */

/** MACSEC - Size of Registers Arrays */
#define MACSEC_MACSEC_RXANINUSS_COUNT             4u
#define MACSEC_MACSEC_RXANIPUSS_COUNT             4u

/** MACSEC - Register Layout Typedef */
typedef struct MACSEC_Struct {
  __IO uint32_t MACSEC_CFG;                        /**< MACsec configuration, offset: 0x0 */
  __IO uint32_t MACSEC_ET;                         /**< MACsec EtherType, offset: 0x4 */
  __IO uint32_t MACSEC_CTPID1;                     /**< MACsec Configured TPID1, offset: 0x8 */
  __IO uint32_t MACSEC_CTPID2;                     /**< MACsec Configured TPID2, offset: 0xC */
  __IO uint32_t MACSEC_VCLCTR;                     /**< MACsec VLAN Classification Control, offset: 0x10 */
  uint8_t RESERVED_0[44];
  __IO uint32_t MACSEC_MFL;                        /**< Maximum Frame Length, offset: 0x40 */
  __IO uint32_t MACSEC_TPNET;                      /**< TX Packet Number exhaustion threshold, offset: 0x44 */
  uint8_t RESERVED_1[56];
  __IO uint32_t MACSEC_RXSCA;                      /**< RX SC access select, offset: 0x80 */
  uint8_t RESERVED_2[60];
  __IO uint32_t MACSEC_TXSCA;                      /**< TX SC access select, offset: 0xC0 */
  uint8_t RESERVED_3[60];
  __IO uint32_t MACSEC_RXSCI1H;                    /**< RX Secure Channel Identifier first half, offset: 0x100 */
  __IO uint32_t MACSEC_RXSCI2H;                    /**< RX Secure Channel Identifier second half, offset: 0x104 */
  uint8_t RESERVED_4[8];
  __IO uint32_t MACSEC_IFIO1HS;                    /**< ifInOctets first half Statistic, offset: 0x110 */
  __IO uint32_t MACSEC_IFIO2HS;                    /**< ifInOctets second half Statistic, offset: 0x114 */
  __IO uint32_t MACSEC_IFIUPS;                     /**< ifInUcastPkts Statistic, offset: 0x118 */
  uint8_t RESERVED_5[4];
  __IO uint32_t MACSEC_IFIMPS;                     /**< ifInMulticastPkts Statistic, offset: 0x120 */
  __IO uint32_t MACSEC_IFIBPS;                     /**< ifInBroadcastPkts Statistic, offset: 0x124 */
  __IO uint32_t MACSEC_RXSCCFG;                    /**< RX Secure Channel configuration, offset: 0x128 */
  __IO uint32_t MACSEC_RPW;                        /**< replayWindow, offset: 0x12C */
  uint8_t RESERVED_6[16];
  __IO uint32_t MACSEC_INOV1HS;                    /**< InOctetsValidated first half Statistic, offset: 0x140 */
  __IO uint32_t MACSEC_INOV2HS;                    /**< InOctetsValidated second half Statistic, offset: 0x144 */
  __IO uint32_t MACSEC_INOD1HS;                    /**< InOctetsDecrypted first half Statistic, offset: 0x148 */
  __IO uint32_t MACSEC_INOD2HS;                    /**< InOctetsDecrypted second half Statistic, offset: 0x14C */
  __IO uint32_t MACSEC_RXSCIPUS;                   /**< RX Secure Channel InPktsUnchecked Statistic, offset: 0x150 */
  __IO uint32_t MACSEC_RXSCIPDS;                   /**< RX Secure Channel InPktsDelayed Statistic, offset: 0x154 */
  __IO uint32_t MACSEC_RXSCIPLS;                   /**< RX Secure Channel InPktsLate Statistic, offset: 0x158 */
  uint8_t RESERVED_7[4];
  __IO uint32_t MACSEC_RXANINUSS[MACSEC_MACSEC_RXANINUSS_COUNT]; /**< RX AN 0 InNotUsingSA Statistic..RX AN 3 InNotUsingSA Statistic, array offset: 0x160, array step: 0x4 */
  __IO uint32_t MACSEC_RXANIPUSS[MACSEC_MACSEC_RXANIPUSS_COUNT]; /**< RX AN 0 InPktsUnusedSA Statistic..RX AN 3 InPktsUnusedSA Statistic, array offset: 0x170, array step: 0x4 */
  __IO uint32_t MACSEC_RXSAACS;                    /**< RX Security Association A configuration and status, offset: 0x180 */
  __IO uint32_t MACSEC_RXSAANPN;                   /**< RX Security Association A nextPN, offset: 0x184 */
  __IO uint32_t MACSEC_RXSAAXNPN;                  /**< RX Security Association Extended A nextPN, offset: 0x188 */
  __IO uint32_t MACSEC_RXSAALPN;                   /**< RX Security Association A lowestPN, offset: 0x18C */
  __IO uint32_t MACSEC_RXSAAXLPN;                  /**< RX Security Association Extended A lowestPN, offset: 0x190 */
  __IO uint32_t MACSEC_RXSAAIPOS;                  /**< RX Security Association A InPktsOK Statistic, offset: 0x194 */
  uint8_t RESERVED_8[24];
  __IO uint32_t MACSEC_RXSAAIPIS;                  /**< RX Security Association A InPktsInvalid Statistic, offset: 0x1B0 */
  __IO uint32_t MACSEC_RXSAAIPNVS;                 /**< RX Security Association A InPktsNotValid Statistic, offset: 0x1B4 */
  uint8_t RESERVED_9[8];
  __IO uint32_t MACSEC_RXSABCS;                    /**< RX Security Association B configuration and status, offset: 0x1C0 */
  __IO uint32_t MACSEC_RXSABNPN;                   /**< RX Security Association B nextPN, offset: 0x1C4 */
  __IO uint32_t MACSEC_RXSABXNPN;                  /**< RX Security Association Extended B nextPN, offset: 0x1C8 */
  __IO uint32_t MACSEC_RXSABLPN;                   /**< RX Security Association B lowestPN, offset: 0x1CC */
  __IO uint32_t MACSEC_RXSABXLPN;                  /**< RX Security Association Extended B lowestPN, offset: 0x1D0 */
  __IO uint32_t MACSEC_RXSABIPOS;                  /**< RX Security Association B InPktsOK Statistic, offset: 0x1D4 */
  uint8_t RESERVED_10[24];
  __IO uint32_t MACSEC_RXSABIPIS;                  /**< RX Security Association B InPktsInvalid Statistic, offset: 0x1F0 */
  __IO uint32_t MACSEC_RXSABIPNVS;                 /**< RX Security Association B InPktsNotValid Statistic, offset: 0x1F4 */
  uint8_t RESERVED_11[8];
  __IO uint32_t MACSEC_TXSCI1H;                    /**< TX Secure Channel Identifier first half, offset: 0x200 */
  __IO uint32_t MACSEC_TXSCI2H;                    /**< TX Secure Channel Identifier second half, offset: 0x204 */
  uint8_t RESERVED_12[8];
  __IO uint32_t MACSEC_IFOO1HS;                    /**< ifOutOctets first half Statistic, offset: 0x210 */
  __IO uint32_t MACSEC_IFOO2HS;                    /**< ifOutOctets second half Statistic, offset: 0x214 */
  __IO uint32_t MACSEC_IFOUPS;                     /**< ifOutUcastPkts Statistic, offset: 0x218 */
  __IO uint32_t MACSEC_OPUS;                       /**< OutPktsUntagged Statistic, offset: 0x21C */
  __IO uint32_t MACSEC_IFOMPS;                     /**< ifOutMulticastPkts Statistic, offset: 0x220 */
  __IO uint32_t MACSEC_IFOBPS;                     /**< ifOutBroadcastPkts Statistic, offset: 0x224 */
  __IO uint32_t MACSEC_TXSCCFG;                    /**< TX Secure Channel configuration, offset: 0x228 */
  __IO uint32_t MACSEC_OPTLS;                      /**< OutPktsTooLong Statistic, offset: 0x22C */
  uint8_t RESERVED_13[16];
  __IO uint32_t MACSEC_OOP1HS;                     /**< OutOctetsProtected first half Statistic, offset: 0x240 */
  __IO uint32_t MACSEC_OOP2HS;                     /**< OutOctetsProtected second half Statistic, offset: 0x244 */
  __IO uint32_t MACSEC_OOE1HS;                     /**< OutOctetsEncrypted first half Statistic, offset: 0x248 */
  __IO uint32_t MACSEC_OOE2HS;                     /**< OutOctetsEncrypted second half Statistic, offset: 0x24C */
  uint8_t RESERVED_14[48];
  __IO uint32_t MACSEC_TXSAACS;                    /**< TX Security Association A configuration and status, offset: 0x280 */
  __IO uint32_t MACSEC_TXSAANPN;                   /**< TX Security Association A nextPN, offset: 0x284 */
  __IO uint32_t MACSEC_TXSAAXNPN;                  /**< TX Security Association Extended A nextPN, offset: 0x288 */
  __IO uint32_t MACSEC_TXSAAOPPS;                  /**< TX Security Association A OutPktsProtected Statistic, offset: 0x28C */
  __IO uint32_t MACSEC_TXSAAOPES;                  /**< TX Security Association A OutPktsEncrypted Statistic, offset: 0x290 */
  uint8_t RESERVED_15[44];
  __IO uint32_t MACSEC_TXSABCS;                    /**< TX Security Association B configuration and status, offset: 0x2C0 */
  __IO uint32_t MACSEC_TXSABNPN;                   /**< TX Security Association B nextPN, offset: 0x2C4 */
  __IO uint32_t MACSEC_TXSABXNPN;                  /**< TX Security Association Extended B nextPN, offset: 0x2C8 */
  __IO uint32_t MACSEC_TXSABOPPS;                  /**< TX Security Association B OutPktsProtected Statistic, offset: 0x2CC */
  __IO uint32_t MACSEC_TXSABOPES;                  /**< TX Security Association B OutPktsEncrypted Statistic, offset: 0x2D0 */
  uint8_t RESERVED_16[292];
  __I  uint32_t MACSEC_IP_REV_1;                   /**< MACsec IP Block Revision 1 register, offset: 0x3F8 */
  __I  uint32_t MACSEC_IP_REV_2;                   /**< MACsec IP Block Revision 2 register, offset: 0x3FC */
  __IO uint32_t MACSEC_EVR;                        /**< MACsec Event Register, offset: 0x400 */
  __IO uint32_t MACSEC_EVER;                       /**< MACsec Event Enable Register, offset: 0x404 */
  uint8_t RESERVED_17[4];
  __IO uint32_t MACSEC_ERR;                        /**< MACsec Error Register, offset: 0x40C */
  __IO uint32_t MACSEC_ERER;                       /**< MACsec Error Enable Register, offset: 0x410 */
  uint8_t RESERVED_18[44];
  __IO uint32_t MACSEC_MEEC;                       /**< MACsec Memory ECC Error Capture Register, offset: 0x440 */
  __I  uint32_t MACSEC_STATUS;                     /**< MACsec Idle status Register, offset: 0x444 */
  uint8_t RESERVED_19[440];
  __IO uint32_t MACSEC_IFIOCP1HS;                  /**< ifInOctetsCp first half Statistic, offset: 0x600 */
  __IO uint32_t MACSEC_IFIOCP2HS;                  /**< ifInOctetsCp second half Statistic, offset: 0x604 */
  __IO uint32_t MACSEC_IFIUPCPS;                   /**< ifInUcastPktsCp Statistic, offset: 0x608 */
  uint8_t RESERVED_20[4];
  __IO uint32_t MACSEC_IFIOUP1HS;                  /**< ifInOctetsUp first half Statistic, offset: 0x610 */
  __IO uint32_t MACSEC_IFIOUP2HS;                  /**< ifInOctetsUp second half Statistic, offset: 0x614 */
  __IO uint32_t MACSEC_IFIUPUPS;                   /**< ifInUcastPktsUp Statistic, offset: 0x618 */
  uint8_t RESERVED_21[4];
  __IO uint32_t MACSEC_IFIMPCPS;                   /**< ifInMulticastPktsCp Statistic, offset: 0x620 */
  __IO uint32_t MACSEC_IFIBPCPS;                   /**< ifInBroadcastPktsCp Statistic, offset: 0x624 */
  __IO uint32_t MACSEC_IFIMPUPS;                   /**< ifInMulticastPktsUp Statistic, offset: 0x628 */
  __IO uint32_t MACSEC_IFIBPUPS;                   /**< ifInBroadcastPktsUp Statistic, offset: 0x62C */
  __IO uint32_t MACSEC_INPWTS;                     /**< InPktsWithoutTag Statistic, offset: 0x630 */
  __IO uint32_t MACSEC_INPKAYS;                    /**< InPktsKaY Statistic, offset: 0x634 */
  __IO uint32_t MACSEC_INPBTS;                     /**< InPktsBadTag Statistic, offset: 0x638 */
  __IO uint32_t MACSEC_IPSNFS;                     /**< InPktsSCINotFound Statistic, offset: 0x63C */
  __IO uint32_t MACSEC_IPUECS;                     /**< InPktsUnsupportedEC Statistic, offset: 0x640 */
  __IO uint32_t MACSEC_IPESCBS;                    /**< nPktsEponSingleCopyBroadcast Statistic, offset: 0x644 */
  __IO uint32_t MACSEC_IPTLS;                      /**< InPktsTooLong Statistic, offset: 0x648 */
  __IO uint32_t MACSEC_IPFUS;                      /**< InPktsFilteredUp Statistic, offset: 0x64C */
  __IO uint32_t MACSEC_IPDUS;                      /**< InPktsDiscardedUp Statistic, offset: 0x650 */
  uint8_t RESERVED_22[44];
  __IO uint32_t MACSEC_OPDS;                       /**< OutPktsDiscarded Statistic, offset: 0x680 */
  uint8_t RESERVED_23[156];
  __IO uint32_t MACSEC_RXSAASSCI;                  /**< RX Security Association A Short Secure Channel Identifier, offset: 0x720 */
  __IO uint32_t MACSEC_RXSAASALT1T;                /**< RX Security Association A SALT 1 of 3, offset: 0x724 */
  __IO uint32_t MACSEC_RXSAASALT2T;                /**< RX Security Association A SALT 2 of 3, offset: 0x728 */
  __IO uint32_t MACSEC_RXSAASALT3T;                /**< RX Security Association A SALT 3 of 3, offset: 0x72C */
  uint8_t RESERVED_24[48];
  __IO uint32_t MACSEC_RXSABSSCI;                  /**< RX Security Association B Short Secure Channel Identifier, offset: 0x760 */
  __IO uint32_t MACSEC_RXSABSALT1T;                /**< RX Security Association B SALT 1 of 3, offset: 0x764 */
  __IO uint32_t MACSEC_RXSABSALT2T;                /**< RX Security Association B SALT 2 of 3, offset: 0x768 */
  __IO uint32_t MACSEC_RXSABSALT3T;                /**< RX Security Association B SALT 3 of 3, offset: 0x76C */
  uint8_t RESERVED_25[48];
  __IO uint32_t MACSEC_TXSAASSCI;                  /**< TX Security Association A Short Secure Channel Identifier, offset: 0x7A0 */
  __IO uint32_t MACSEC_TXSAASALT1T;                /**< TX Security Association A SALT 1 of 3, offset: 0x7A4 */
  __IO uint32_t MACSEC_TXSAASALT2T;                /**< TX Security Association A SALT 2 of 3, offset: 0x7A8 */
  __IO uint32_t MACSEC_TXSAASALT3T;                /**< TX Security Association A SALT 3 of 3, offset: 0x7AC */
  uint8_t RESERVED_26[48];
  __IO uint32_t MACSEC_TXSABSSCI;                  /**< TX Security Association B Short Secure Channel Identifier, offset: 0x7E0 */
  __IO uint32_t MACSEC_TXSABSALT1T;                /**< TX Security Association B SALT 1 of 3, offset: 0x7E4 */
  __IO uint32_t MACSEC_TXSABSALT2T;                /**< TX Security Association B SALT 2 of 3, offset: 0x7E8 */
  __IO uint32_t MACSEC_TXSABSALT3T;                /**< TX Security Association B SALT 3 of 3, offset: 0x7EC */
  uint8_t RESERVED_27[16];
  __IO uint32_t MACSEC_TXSCSR0P0;                  /**< TX SC Selection Record 0 part 0, offset: 0x800 */
  __IO uint32_t MACSEC_TXSCSR0P1;                  /**< TX SC Selection Record 0 part 1, offset: 0x804 */
  __IO uint32_t MACSEC_TXSCSR0P2;                  /**< TX SC Selection Record 0 part 2, offset: 0x808 */
  __IO uint32_t MACSEC_TXSCSR0P3;                  /**< TX SC Selection Record 0 part 3, offset: 0x80C */
  __IO uint32_t MACSEC_TXSCSR1P0;                  /**< TX SC Selection Record 1 part 0, offset: 0x810 */
  __IO uint32_t MACSEC_TXSCSR1P1;                  /**< TX SC Selection Record 1 part 1, offset: 0x814 */
  __IO uint32_t MACSEC_TXSCSR1P2;                  /**< TX SC Selection Record 1 part 2, offset: 0x818 */
  __IO uint32_t MACSEC_TXSCSR1P3;                  /**< TX SC Selection Record 1 part 3, offset: 0x81C */
  __IO uint32_t MACSEC_TXSCSR2P0;                  /**< TX SC Selection Record 2 part 0, offset: 0x820 */
  __IO uint32_t MACSEC_TXSCSR2P1;                  /**< TX SC Selection Record 2 part 1, offset: 0x824 */
  __IO uint32_t MACSEC_TXSCSR2P2;                  /**< TX SC Selection Record 2 part 2, offset: 0x828 */
  __IO uint32_t MACSEC_TXSCSR2P3;                  /**< TX SC Selection Record 2 part 3, offset: 0x82C */
  __IO uint32_t MACSEC_TXSCSR3P0;                  /**< TX SC Selection Record 3 part 0, offset: 0x830 */
  __IO uint32_t MACSEC_TXSCSR3P1;                  /**< TX SC Selection Record 3 part 1, offset: 0x834 */
  __IO uint32_t MACSEC_TXSCSR3P2;                  /**< TX SC Selection Record 3 part 2, offset: 0x838 */
  __IO uint32_t MACSEC_TXSCSR3P3;                  /**< TX SC Selection Record 3 part 3, offset: 0x83C */
  __IO uint32_t MACSEC_TXSCSR4P0;                  /**< TX SC Selection Record 4 part 0, offset: 0x840 */
  __IO uint32_t MACSEC_TXSCSR4P1;                  /**< TX SC Selection Record 4 part 1, offset: 0x844 */
  __IO uint32_t MACSEC_TXSCSR4P2;                  /**< TX SC Selection Record 4 part 2, offset: 0x848 */
  __IO uint32_t MACSEC_TXSCSR4P3;                  /**< TX SC Selection Record 4 part 3, offset: 0x84C */
  __IO uint32_t MACSEC_TXSCSR5P0;                  /**< TX SC Selection Record 5 part 0, offset: 0x850 */
  __IO uint32_t MACSEC_TXSCSR5P1;                  /**< TX SC Selection Record 5 part 1, offset: 0x854 */
  __IO uint32_t MACSEC_TXSCSR5P2;                  /**< TX SC Selection Record 5 part 2, offset: 0x858 */
  __IO uint32_t MACSEC_TXSCSR5P3;                  /**< TX SC Selection Record 5 part 3, offset: 0x85C */
  __IO uint32_t MACSEC_TXSCSR6P0;                  /**< TX SC Selection Record 6 part 0, offset: 0x860 */
  __IO uint32_t MACSEC_TXSCSR6P1;                  /**< TX SC Selection Record 6 part 1, offset: 0x864 */
  __IO uint32_t MACSEC_TXSCSR6P2;                  /**< TX SC Selection Record 6 part 2, offset: 0x868 */
  __IO uint32_t MACSEC_TXSCSR6P3;                  /**< TX SC Selection Record 6 part 3, offset: 0x86C */
  __IO uint32_t MACSEC_TXSCSR7P0;                  /**< TX SC Selection Record 7 part 0, offset: 0x870 */
  __IO uint32_t MACSEC_TXSCSR7P1;                  /**< TX SC Selection Record 7 part 1, offset: 0x874 */
  __IO uint32_t MACSEC_TXSCSR7P2;                  /**< TX SC Selection Record 7 part 2, offset: 0x878 */
  __IO uint32_t MACSEC_TXSCSR7P3;                  /**< TX SC Selection Record 7 part 3, offset: 0x87C */
  uint8_t RESERVED_28[384];
  __IO uint32_t MACSEC_UPFR0D0;                    /**< Uncontrolled Port filter Record 0 data part 0, offset: 0xA00 */
  __IO uint32_t MACSEC_UPFR0D1;                    /**< Uncontrolled Port filter Record 0 data part 1, offset: 0xA04 */
  __IO uint32_t MACSEC_UPFR0D2;                    /**< Uncontrolled Port filter Record 0 data part 2, offset: 0xA08 */
  __IO uint32_t MACSEC_UPFR0M0;                    /**< Uncontrolled Port filter Record 0 mask part 0, offset: 0xA0C */
  __IO uint32_t MACSEC_UPFR0M1;                    /**< Uncontrolled Port filter Record 0 mask part 1, offset: 0xA10 */
  __IO uint32_t MACSEC_UPFR0M2;                    /**< Uncontrolled Port filter Record 0 mask part 2, offset: 0xA14 */
  __IO uint32_t MACSEC_UPFR0R;                     /**< Uncontrolled Port filter Record 0 Result, offset: 0xA18 */
  uint8_t RESERVED_29[4];
  __IO uint32_t MACSEC_UPFR1D0;                    /**< Uncontrolled Port filter Record 1 data part 0, offset: 0xA20 */
  __IO uint32_t MACSEC_UPFR1D1;                    /**< Uncontrolled Port filter Record 1 data part 1, offset: 0xA24 */
  __IO uint32_t MACSEC_UPFR1D2;                    /**< Uncontrolled Port filter Record 1 data part 2, offset: 0xA28 */
  __IO uint32_t MACSEC_UPFR1M0;                    /**< Uncontrolled Port filter Record 1 mask part 0, offset: 0xA2C */
  __IO uint32_t MACSEC_UPFR1M1;                    /**< Uncontrolled Port filter Record 1 mask part 1, offset: 0xA30 */
  __IO uint32_t MACSEC_UPFR1M2;                    /**< Uncontrolled Port filter Record 1 mask part 2, offset: 0xA34 */
  __IO uint32_t MACSEC_UPFR1R;                     /**< Uncontrolled Port filter Record 1 Result, offset: 0xA38 */
  uint8_t RESERVED_30[4];
  __IO uint32_t MACSEC_UPFR2D0;                    /**< Uncontrolled Port filter Record 2 data part 0, offset: 0xA40 */
  __IO uint32_t MACSEC_UPFR2D1;                    /**< Uncontrolled Port filter Record 2 data part 1, offset: 0xA44 */
  __IO uint32_t MACSEC_UPFR2D2;                    /**< Uncontrolled Port filter Record 2 data part 2, offset: 0xA48 */
  __IO uint32_t MACSEC_UPFR2M0;                    /**< Uncontrolled Port filter Record 2 mask part 0, offset: 0xA4C */
  __IO uint32_t MACSEC_UPFR2M1;                    /**< Uncontrolled Port filter Record 2 mask part 1, offset: 0xA50 */
  __IO uint32_t MACSEC_UPFR2M2;                    /**< Uncontrolled Port filter Record 2 mask part 2, offset: 0xA54 */
  __IO uint32_t MACSEC_UPFR2R;                     /**< Uncontrolled Port filter Record 2 Result, offset: 0xA58 */
  uint8_t RESERVED_31[4];
  __IO uint32_t MACSEC_UPFR3D0;                    /**< Uncontrolled Port filter Record 3 data part 0, offset: 0xA60 */
  __IO uint32_t MACSEC_UPFR3D1;                    /**< Uncontrolled Port filter Record 3 data part 1, offset: 0xA64 */
  __IO uint32_t MACSEC_UPFR3D2;                    /**< Uncontrolled Port filter Record 3 data part 2, offset: 0xA68 */
  __IO uint32_t MACSEC_UPFR3M0;                    /**< Uncontrolled Port filter Record 3 mask part 0, offset: 0xA6C */
  __IO uint32_t MACSEC_UPFR3M1;                    /**< Uncontrolled Port filter Record 3 mask part 1, offset: 0xA70 */
  __IO uint32_t MACSEC_UPFR3M2;                    /**< Uncontrolled Port filter Record 3 mask part 2, offset: 0xA74 */
  __IO uint32_t MACSEC_UPFR3R;                     /**< Uncontrolled Port filter Record 3 Result, offset: 0xA78 */
  uint8_t RESERVED_32[4];
  __IO uint32_t MACSEC_UPFR4D0;                    /**< Uncontrolled Port filter Record 4 data part 0, offset: 0xA80 */
  __IO uint32_t MACSEC_UPFR4D1;                    /**< Uncontrolled Port filter Record 4 data part 1, offset: 0xA84 */
  __IO uint32_t MACSEC_UPFR4D2;                    /**< Uncontrolled Port filter Record 4 data part 2, offset: 0xA88 */
  __IO uint32_t MACSEC_UPFR4M0;                    /**< Uncontrolled Port filter Record 4 mask part 0, offset: 0xA8C */
  __IO uint32_t MACSEC_UPFR4M1;                    /**< Uncontrolled Port filter Record 4 mask part 1, offset: 0xA90 */
  __IO uint32_t MACSEC_UPFR4M2;                    /**< Uncontrolled Port filter Record 4 mask part 2, offset: 0xA94 */
  __IO uint32_t MACSEC_UPFR4R;                     /**< Uncontrolled Port filter Record 4 Result, offset: 0xA98 */
  uint8_t RESERVED_33[4];
  __IO uint32_t MACSEC_UPFR5D0;                    /**< Uncontrolled Port filter Record 5 data part 0, offset: 0xAA0 */
  __IO uint32_t MACSEC_UPFR5D1;                    /**< Uncontrolled Port filter Record 5 data part 1, offset: 0xAA4 */
  __IO uint32_t MACSEC_UPFR5D2;                    /**< Uncontrolled Port filter Record 5 data part 2, offset: 0xAA8 */
  __IO uint32_t MACSEC_UPFR5M0;                    /**< Uncontrolled Port filter Record 5 mask part 0, offset: 0xAAC */
  __IO uint32_t MACSEC_UPFR5M1;                    /**< Uncontrolled Port filter Record 5 mask part 1, offset: 0xAB0 */
  __IO uint32_t MACSEC_UPFR5M2;                    /**< Uncontrolled Port filter Record 5 mask part 2, offset: 0xAB4 */
