zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MACSEC.h
  __IO uint32_t MACSEC_UPFR5R;                     /**< Uncontrolled Port filter Record 5 Result, offset: 0xAB8 */
  uint8_t RESERVED_34[4];
  __IO uint32_t MACSEC_UPFR6D0;                    /**< Uncontrolled Port filter Record 6 data part 0, offset: 0xAC0 */
  __IO uint32_t MACSEC_UPFR6D1;                    /**< Uncontrolled Port filter Record 6 data part 1, offset: 0xAC4 */
  __IO uint32_t MACSEC_UPFR6D2;                    /**< Uncontrolled Port filter Record 6 data part 2, offset: 0xAC8 */
  __IO uint32_t MACSEC_UPFR6M0;                    /**< Uncontrolled Port filter Record 6 mask part 0, offset: 0xACC */
  __IO uint32_t MACSEC_UPFR6M1;                    /**< Uncontrolled Port filter Record 6 mask part 1, offset: 0xAD0 */
  __IO uint32_t MACSEC_UPFR6M2;                    /**< Uncontrolled Port filter Record 6 mask part 2, offset: 0xAD4 */
  __IO uint32_t MACSEC_UPFR6R;                     /**< Uncontrolled Port filter Record 6 Result, offset: 0xAD8 */
  uint8_t RESERVED_35[4];
  __IO uint32_t MACSEC_UPFR7D0;                    /**< Uncontrolled Port filter Record 7 data part 0, offset: 0xAE0 */
  __IO uint32_t MACSEC_UPFR7D1;                    /**< Uncontrolled Port filter Record 7 data part 1, offset: 0xAE4 */
  __IO uint32_t MACSEC_UPFR7D2;                    /**< Uncontrolled Port filter Record 7 data part 2, offset: 0xAE8 */
  __IO uint32_t MACSEC_UPFR7M0;                    /**< Uncontrolled Port filter Record 7 mask part 0, offset: 0xAEC */
  __IO uint32_t MACSEC_UPFR7M1;                    /**< Uncontrolled Port filter Record 7 mask part 1, offset: 0xAF0 */
  __IO uint32_t MACSEC_UPFR7M2;                    /**< Uncontrolled Port filter Record 7 mask part 2, offset: 0xAF4 */
  __IO uint32_t MACSEC_UPFR7R;                     /**< Uncontrolled Port filter Record 7 Result, offset: 0xAF8 */
} MACSEC_Type, *MACSEC_MemMapPtr;

/** Number of instances of the MACSEC module. */
#define MACSEC_INSTANCE_COUNT                    (5u)

/* MACSEC - Peripheral instance base addresses */
/** Peripheral NETC__SW0_ETH_MACSEC_PORT0 base address */
#define IP_NETC__SW0_ETH_MACSEC_PORT0_BASE       (0x6D006000u)
/** Peripheral NETC__SW0_ETH_MACSEC_PORT0 base pointer */
#define IP_NETC__SW0_ETH_MACSEC_PORT0            ((MACSEC_Type *)IP_NETC__SW0_ETH_MACSEC_PORT0_BASE)
/** Peripheral NETC__SW0_ETH_MACSEC_PORT1 base address */
#define IP_NETC__SW0_ETH_MACSEC_PORT1_BASE       (0x6D00A000u)
/** Peripheral NETC__SW0_ETH_MACSEC_PORT1 base pointer */
#define IP_NETC__SW0_ETH_MACSEC_PORT1            ((MACSEC_Type *)IP_NETC__SW0_ETH_MACSEC_PORT1_BASE)
/** Peripheral NETC__SW0_ETH_MACSEC_PORT2 base address */
#define IP_NETC__SW0_ETH_MACSEC_PORT2_BASE       (0x6D00E000u)
/** Peripheral NETC__SW0_ETH_MACSEC_PORT2 base pointer */
#define IP_NETC__SW0_ETH_MACSEC_PORT2            ((MACSEC_Type *)IP_NETC__SW0_ETH_MACSEC_PORT2_BASE)
/** Peripheral NETC__SW0_ETH_MACSEC_PORT3 base address */
#define IP_NETC__SW0_ETH_MACSEC_PORT3_BASE       (0x6D012000u)
/** Peripheral NETC__SW0_ETH_MACSEC_PORT3 base pointer */
#define IP_NETC__SW0_ETH_MACSEC_PORT3            ((MACSEC_Type *)IP_NETC__SW0_ETH_MACSEC_PORT3_BASE)
/** Peripheral NETC__SW0_ETH_MACSEC_PORT4 base address */
#define IP_NETC__SW0_ETH_MACSEC_PORT4_BASE       (0x6D016000u)
/** Peripheral NETC__SW0_ETH_MACSEC_PORT4 base pointer */
#define IP_NETC__SW0_ETH_MACSEC_PORT4            ((MACSEC_Type *)IP_NETC__SW0_ETH_MACSEC_PORT4_BASE)
/** Array initializer of MACSEC peripheral base addresses */
#define IP_MACSEC_BASE_ADDRS                     { IP_NETC__SW0_ETH_MACSEC_PORT0_BASE, IP_NETC__SW0_ETH_MACSEC_PORT1_BASE, IP_NETC__SW0_ETH_MACSEC_PORT2_BASE, IP_NETC__SW0_ETH_MACSEC_PORT3_BASE, IP_NETC__SW0_ETH_MACSEC_PORT4_BASE }
/** Array initializer of MACSEC peripheral base pointers */
#define IP_MACSEC_BASE_PTRS                      { IP_NETC__SW0_ETH_MACSEC_PORT0, IP_NETC__SW0_ETH_MACSEC_PORT1, IP_NETC__SW0_ETH_MACSEC_PORT2, IP_NETC__SW0_ETH_MACSEC_PORT3, IP_NETC__SW0_ETH_MACSEC_PORT4 }

/* ----------------------------------------------------------------------------
   -- MACSEC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MACSEC_Register_Masks MACSEC Register Masks
 * @{
 */

/*! @name MACSEC_CFG - MACsec configuration */
/*! @{ */

#define MACSEC_MACSEC_CFG_S0I_MASK               (0x1U)
#define MACSEC_MACSEC_CFG_S0I_SHIFT              (0U)
#define MACSEC_MACSEC_CFG_S0I_WIDTH              (1U)
#define MACSEC_MACSEC_CFG_S0I(x)                 (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CFG_S0I_SHIFT)) & MACSEC_MACSEC_CFG_S0I_MASK)

#define MACSEC_MACSEC_CFG_BYPN_MASK              (0x2U)
#define MACSEC_MACSEC_CFG_BYPN_SHIFT             (1U)
#define MACSEC_MACSEC_CFG_BYPN_WIDTH             (1U)
#define MACSEC_MACSEC_CFG_BYPN(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CFG_BYPN_SHIFT)) & MACSEC_MACSEC_CFG_BYPN_MASK)

#define MACSEC_MACSEC_CFG_KSS_MASK               (0x4U)
#define MACSEC_MACSEC_CFG_KSS_SHIFT              (2U)
#define MACSEC_MACSEC_CFG_KSS_WIDTH              (1U)
#define MACSEC_MACSEC_CFG_KSS(x)                 (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CFG_KSS_SHIFT)) & MACSEC_MACSEC_CFG_KSS_MASK)

#define MACSEC_MACSEC_CFG_VFN_MASK               (0x8U)
#define MACSEC_MACSEC_CFG_VFN_SHIFT              (3U)
#define MACSEC_MACSEC_CFG_VFN_WIDTH              (1U)
#define MACSEC_MACSEC_CFG_VFN(x)                 (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CFG_VFN_SHIFT)) & MACSEC_MACSEC_CFG_VFN_MASK)

#define MACSEC_MACSEC_CFG_UFT_MASK               (0x30U)
#define MACSEC_MACSEC_CFG_UFT_SHIFT              (4U)
#define MACSEC_MACSEC_CFG_UFT_WIDTH              (2U)
#define MACSEC_MACSEC_CFG_UFT(x)                 (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CFG_UFT_SHIFT)) & MACSEC_MACSEC_CFG_UFT_MASK)

#define MACSEC_MACSEC_CFG_KFT_MASK               (0x40U)
#define MACSEC_MACSEC_CFG_KFT_SHIFT              (6U)
#define MACSEC_MACSEC_CFG_KFT_WIDTH              (1U)
#define MACSEC_MACSEC_CFG_KFT(x)                 (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CFG_KFT_SHIFT)) & MACSEC_MACSEC_CFG_KFT_MASK)

#define MACSEC_MACSEC_CFG_ITT_MASK               (0x80U)
#define MACSEC_MACSEC_CFG_ITT_SHIFT              (7U)
#define MACSEC_MACSEC_CFG_ITT_WIDTH              (1U)
#define MACSEC_MACSEC_CFG_ITT(x)                 (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CFG_ITT_SHIFT)) & MACSEC_MACSEC_CFG_ITT_MASK)

#define MACSEC_MACSEC_CFG_USFT_MASK              (0x300U)
#define MACSEC_MACSEC_CFG_USFT_SHIFT             (8U)
#define MACSEC_MACSEC_CFG_USFT_WIDTH             (2U)
#define MACSEC_MACSEC_CFG_USFT(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CFG_USFT_SHIFT)) & MACSEC_MACSEC_CFG_USFT_MASK)

#define MACSEC_MACSEC_CFG_ESCBT_MASK             (0x400U)
#define MACSEC_MACSEC_CFG_ESCBT_SHIFT            (10U)
#define MACSEC_MACSEC_CFG_ESCBT_WIDTH            (1U)
#define MACSEC_MACSEC_CFG_ESCBT(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CFG_ESCBT_SHIFT)) & MACSEC_MACSEC_CFG_ESCBT_MASK)

#define MACSEC_MACSEC_CFG_UECT_MASK              (0x800U)
#define MACSEC_MACSEC_CFG_UECT_SHIFT             (11U)
#define MACSEC_MACSEC_CFG_UECT_WIDTH             (1U)
#define MACSEC_MACSEC_CFG_UECT(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CFG_UECT_SHIFT)) & MACSEC_MACSEC_CFG_UECT_MASK)

#define MACSEC_MACSEC_CFG_UPSCMT_MASK            (0x1000U)
#define MACSEC_MACSEC_CFG_UPSCMT_SHIFT           (12U)
#define MACSEC_MACSEC_CFG_UPSCMT_WIDTH           (1U)
#define MACSEC_MACSEC_CFG_UPSCMT(x)              (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CFG_UPSCMT_SHIFT)) & MACSEC_MACSEC_CFG_UPSCMT_MASK)

#define MACSEC_MACSEC_CFG_KSSHD_MASK             (0x2000U)
#define MACSEC_MACSEC_CFG_KSSHD_SHIFT            (13U)
#define MACSEC_MACSEC_CFG_KSSHD_WIDTH            (1U)
#define MACSEC_MACSEC_CFG_KSSHD(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CFG_KSSHD_SHIFT)) & MACSEC_MACSEC_CFG_KSSHD_MASK)

#define MACSEC_MACSEC_CFG_SLC_MASK               (0x10000U)
#define MACSEC_MACSEC_CFG_SLC_SHIFT              (16U)
#define MACSEC_MACSEC_CFG_SLC_WIDTH              (1U)
#define MACSEC_MACSEC_CFG_SLC(x)                 (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CFG_SLC_SHIFT)) & MACSEC_MACSEC_CFG_SLC_MASK)

#define MACSEC_MACSEC_CFG_SLD_MASK               (0x20000U)
#define MACSEC_MACSEC_CFG_SLD_SHIFT              (17U)
#define MACSEC_MACSEC_CFG_SLD_WIDTH              (1U)
#define MACSEC_MACSEC_CFG_SLD(x)                 (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CFG_SLD_SHIFT)) & MACSEC_MACSEC_CFG_SLD_MASK)

