zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MACSEC.h
#define MACSEC_MACSEC_CFG_VCT_MASK               (0x1000000U)
#define MACSEC_MACSEC_CFG_VCT_SHIFT              (24U)
#define MACSEC_MACSEC_CFG_VCT_WIDTH              (1U)
#define MACSEC_MACSEC_CFG_VCT(x)                 (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CFG_VCT_SHIFT)) & MACSEC_MACSEC_CFG_VCT_MASK)

#define MACSEC_MACSEC_CFG_UFDCD_MASK             (0x2000000U)
#define MACSEC_MACSEC_CFG_UFDCD_SHIFT            (25U)
#define MACSEC_MACSEC_CFG_UFDCD_WIDTH            (1U)
#define MACSEC_MACSEC_CFG_UFDCD(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CFG_UFDCD_SHIFT)) & MACSEC_MACSEC_CFG_UFDCD_MASK)

#define MACSEC_MACSEC_CFG_EXTSCS_MASK            (0x4000000U)
#define MACSEC_MACSEC_CFG_EXTSCS_SHIFT           (26U)
#define MACSEC_MACSEC_CFG_EXTSCS_WIDTH           (1U)
#define MACSEC_MACSEC_CFG_EXTSCS(x)              (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CFG_EXTSCS_SHIFT)) & MACSEC_MACSEC_CFG_EXTSCS_MASK)

#define MACSEC_MACSEC_CFG_UFDCM_MASK             (0x8000000U)
#define MACSEC_MACSEC_CFG_UFDCM_SHIFT            (27U)
#define MACSEC_MACSEC_CFG_UFDCM_WIDTH            (1U)
#define MACSEC_MACSEC_CFG_UFDCM(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CFG_UFDCM_SHIFT)) & MACSEC_MACSEC_CFG_UFDCM_MASK)
/*! @} */

/*! @name MACSEC_ET - MACsec EtherType */
/*! @{ */

#define MACSEC_MACSEC_ET_MACSEC_ET_MASK          (0xFFFFU)
#define MACSEC_MACSEC_ET_MACSEC_ET_SHIFT         (0U)
#define MACSEC_MACSEC_ET_MACSEC_ET_WIDTH         (16U)
#define MACSEC_MACSEC_ET_MACSEC_ET(x)            (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_ET_MACSEC_ET_SHIFT)) & MACSEC_MACSEC_ET_MACSEC_ET_MASK)
/*! @} */

/*! @name MACSEC_CTPID1 - MACsec Configured TPID1 */
/*! @{ */

#define MACSEC_MACSEC_CTPID1_ETYPE_MASK          (0xFFFFU)
#define MACSEC_MACSEC_CTPID1_ETYPE_SHIFT         (0U)
#define MACSEC_MACSEC_CTPID1_ETYPE_WIDTH         (16U)
#define MACSEC_MACSEC_CTPID1_ETYPE(x)            (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CTPID1_ETYPE_SHIFT)) & MACSEC_MACSEC_CTPID1_ETYPE_MASK)

#define MACSEC_MACSEC_CTPID1_V_MASK              (0x80000000U)
#define MACSEC_MACSEC_CTPID1_V_SHIFT             (31U)
#define MACSEC_MACSEC_CTPID1_V_WIDTH             (1U)
#define MACSEC_MACSEC_CTPID1_V(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CTPID1_V_SHIFT)) & MACSEC_MACSEC_CTPID1_V_MASK)
/*! @} */

/*! @name MACSEC_CTPID2 - MACsec Configured TPID2 */
/*! @{ */

#define MACSEC_MACSEC_CTPID2_ETYPE_MASK          (0xFFFFU)
#define MACSEC_MACSEC_CTPID2_ETYPE_SHIFT         (0U)
#define MACSEC_MACSEC_CTPID2_ETYPE_WIDTH         (16U)
#define MACSEC_MACSEC_CTPID2_ETYPE(x)            (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CTPID2_ETYPE_SHIFT)) & MACSEC_MACSEC_CTPID2_ETYPE_MASK)

#define MACSEC_MACSEC_CTPID2_TAG_SIZE_MASK       (0x1F0000U)
#define MACSEC_MACSEC_CTPID2_TAG_SIZE_SHIFT      (16U)
#define MACSEC_MACSEC_CTPID2_TAG_SIZE_WIDTH      (5U)
#define MACSEC_MACSEC_CTPID2_TAG_SIZE(x)         (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CTPID2_TAG_SIZE_SHIFT)) & MACSEC_MACSEC_CTPID2_TAG_SIZE_MASK)

#define MACSEC_MACSEC_CTPID2_VLAN_MASK           (0x40000000U)
#define MACSEC_MACSEC_CTPID2_VLAN_SHIFT          (30U)
#define MACSEC_MACSEC_CTPID2_VLAN_WIDTH          (1U)
#define MACSEC_MACSEC_CTPID2_VLAN(x)             (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CTPID2_VLAN_SHIFT)) & MACSEC_MACSEC_CTPID2_VLAN_MASK)

#define MACSEC_MACSEC_CTPID2_V_MASK              (0x80000000U)
#define MACSEC_MACSEC_CTPID2_V_SHIFT             (31U)
#define MACSEC_MACSEC_CTPID2_V_WIDTH             (1U)
#define MACSEC_MACSEC_CTPID2_V(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_CTPID2_V_SHIFT)) & MACSEC_MACSEC_CTPID2_V_MASK)
/*! @} */

/*! @name MACSEC_VCLCTR - MACsec VLAN Classification Control */
/*! @{ */

#define MACSEC_MACSEC_VCLCTR_OVTPIDL_MASK        (0xFU)
#define MACSEC_MACSEC_VCLCTR_OVTPIDL_SHIFT       (0U)
#define MACSEC_MACSEC_VCLCTR_OVTPIDL_WIDTH       (4U)
#define MACSEC_MACSEC_VCLCTR_OVTPIDL(x)          (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_VCLCTR_OVTPIDL_SHIFT)) & MACSEC_MACSEC_VCLCTR_OVTPIDL_MASK)

#define MACSEC_MACSEC_VCLCTR_IVTPIDL_MASK        (0xF0U)
#define MACSEC_MACSEC_VCLCTR_IVTPIDL_SHIFT       (4U)
#define MACSEC_MACSEC_VCLCTR_IVTPIDL_WIDTH       (4U)
#define MACSEC_MACSEC_VCLCTR_IVTPIDL(x)          (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_VCLCTR_IVTPIDL_SHIFT)) & MACSEC_MACSEC_VCLCTR_IVTPIDL_MASK)

#define MACSEC_MACSEC_VCLCTR_CTTPIDL_MASK        (0x100U)
#define MACSEC_MACSEC_VCLCTR_CTTPIDL_SHIFT       (8U)
#define MACSEC_MACSEC_VCLCTR_CTTPIDL_WIDTH       (1U)
#define MACSEC_MACSEC_VCLCTR_CTTPIDL(x)          (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_VCLCTR_CTTPIDL_SHIFT)) & MACSEC_MACSEC_VCLCTR_CTTPIDL_MASK)
/*! @} */

/*! @name MACSEC_MFL - Maximum Frame Length */
/*! @{ */

#define MACSEC_MACSEC_MFL_MAX_LEN_MASK           (0xFFFFU)
#define MACSEC_MACSEC_MFL_MAX_LEN_SHIFT          (0U)
#define MACSEC_MACSEC_MFL_MAX_LEN_WIDTH          (16U)
#define MACSEC_MACSEC_MFL_MAX_LEN(x)             (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_MFL_MAX_LEN_SHIFT)) & MACSEC_MACSEC_MFL_MAX_LEN_MASK)
/*! @} */

/*! @name MACSEC_TPNET - TX Packet Number exhaustion threshold */
/*! @{ */

#define MACSEC_MACSEC_TPNET_EXH_THR_MASK         (0xFFFFFFFFU)
#define MACSEC_MACSEC_TPNET_EXH_THR_SHIFT        (0U)
#define MACSEC_MACSEC_TPNET_EXH_THR_WIDTH        (32U)
#define MACSEC_MACSEC_TPNET_EXH_THR(x)           (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TPNET_EXH_THR_SHIFT)) & MACSEC_MACSEC_TPNET_EXH_THR_MASK)
/*! @} */

/*! @name MACSEC_RXSCA - RX SC access select */
/*! @{ */

#define MACSEC_MACSEC_RXSCA_SC_SEL_MASK          (0x3FU)
#define MACSEC_MACSEC_RXSCA_SC_SEL_SHIFT         (0U)
#define MACSEC_MACSEC_RXSCA_SC_SEL_WIDTH         (6U)
#define MACSEC_MACSEC_RXSCA_SC_SEL(x)            (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSCA_SC_SEL_SHIFT)) & MACSEC_MACSEC_RXSCA_SC_SEL_MASK)
/*! @} */

/*! @name MACSEC_TXSCA - TX SC access select */
/*! @{ */

