zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MACSEC.h
#define MACSEC_MACSEC_TXSCA_SC_SEL_MASK          (0x1FU)
#define MACSEC_MACSEC_TXSCA_SC_SEL_SHIFT         (0U)
#define MACSEC_MACSEC_TXSCA_SC_SEL_WIDTH         (5U)
#define MACSEC_MACSEC_TXSCA_SC_SEL(x)            (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCA_SC_SEL_SHIFT)) & MACSEC_MACSEC_TXSCA_SC_SEL_MASK)
/*! @} */

/*! @name MACSEC_RXSCI1H - RX Secure Channel Identifier first half */
/*! @{ */

#define MACSEC_MACSEC_RXSCI1H_RXSCI_MASK         (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSCI1H_RXSCI_SHIFT        (0U)
#define MACSEC_MACSEC_RXSCI1H_RXSCI_WIDTH        (32U)
#define MACSEC_MACSEC_RXSCI1H_RXSCI(x)           (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSCI1H_RXSCI_SHIFT)) & MACSEC_MACSEC_RXSCI1H_RXSCI_MASK)
/*! @} */

/*! @name MACSEC_RXSCI2H - RX Secure Channel Identifier second half */
/*! @{ */

#define MACSEC_MACSEC_RXSCI2H_RXSCI_MASK         (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSCI2H_RXSCI_SHIFT        (0U)
#define MACSEC_MACSEC_RXSCI2H_RXSCI_WIDTH        (32U)
#define MACSEC_MACSEC_RXSCI2H_RXSCI(x)           (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSCI2H_RXSCI_SHIFT)) & MACSEC_MACSEC_RXSCI2H_RXSCI_MASK)
/*! @} */

/*! @name MACSEC_IFIO1HS - ifInOctets first half Statistic */
/*! @{ */

#define MACSEC_MACSEC_IFIO1HS_ifInOctets_MASK    (0xFFFFFFFFU)
#define MACSEC_MACSEC_IFIO1HS_ifInOctets_SHIFT   (0U)
#define MACSEC_MACSEC_IFIO1HS_ifInOctets_WIDTH   (32U)
#define MACSEC_MACSEC_IFIO1HS_ifInOctets(x)      (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IFIO1HS_ifInOctets_SHIFT)) & MACSEC_MACSEC_IFIO1HS_ifInOctets_MASK)
/*! @} */

/*! @name MACSEC_IFIO2HS - ifInOctets second half Statistic */
/*! @{ */

#define MACSEC_MACSEC_IFIO2HS_ifInOctets_MASK    (0xFFFFFFFFU)
#define MACSEC_MACSEC_IFIO2HS_ifInOctets_SHIFT   (0U)
#define MACSEC_MACSEC_IFIO2HS_ifInOctets_WIDTH   (32U)
#define MACSEC_MACSEC_IFIO2HS_ifInOctets(x)      (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IFIO2HS_ifInOctets_SHIFT)) & MACSEC_MACSEC_IFIO2HS_ifInOctets_MASK)
/*! @} */

/*! @name MACSEC_IFIUPS - ifInUcastPkts Statistic */
/*! @{ */

#define MACSEC_MACSEC_IFIUPS_ifInUcastPkts_MASK  (0xFFFFFFFFU)
#define MACSEC_MACSEC_IFIUPS_ifInUcastPkts_SHIFT (0U)
#define MACSEC_MACSEC_IFIUPS_ifInUcastPkts_WIDTH (32U)
#define MACSEC_MACSEC_IFIUPS_ifInUcastPkts(x)    (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IFIUPS_ifInUcastPkts_SHIFT)) & MACSEC_MACSEC_IFIUPS_ifInUcastPkts_MASK)
/*! @} */

/*! @name MACSEC_IFIMPS - ifInMulticastPkts Statistic */
/*! @{ */

#define MACSEC_MACSEC_IFIMPS_ifInMulticastPkts_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_IFIMPS_ifInMulticastPkts_SHIFT (0U)
#define MACSEC_MACSEC_IFIMPS_ifInMulticastPkts_WIDTH (32U)
#define MACSEC_MACSEC_IFIMPS_ifInMulticastPkts(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IFIMPS_ifInMulticastPkts_SHIFT)) & MACSEC_MACSEC_IFIMPS_ifInMulticastPkts_MASK)
/*! @} */

/*! @name MACSEC_IFIBPS - ifInBroadcastPkts Statistic */
/*! @{ */

#define MACSEC_MACSEC_IFIBPS_ifInBroadcastPkts_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_IFIBPS_ifInBroadcastPkts_SHIFT (0U)
#define MACSEC_MACSEC_IFIBPS_ifInBroadcastPkts_WIDTH (32U)
#define MACSEC_MACSEC_IFIBPS_ifInBroadcastPkts(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IFIBPS_ifInBroadcastPkts_SHIFT)) & MACSEC_MACSEC_IFIBPS_ifInBroadcastPkts_MASK)
/*! @} */

/*! @name MACSEC_RXSCCFG - RX Secure Channel configuration */
/*! @{ */

#define MACSEC_MACSEC_RXSCCFG_CO_MASK            (0x3FU)
#define MACSEC_MACSEC_RXSCCFG_CO_SHIFT           (0U)
#define MACSEC_MACSEC_RXSCCFG_CO_WIDTH           (6U)
#define MACSEC_MACSEC_RXSCCFG_CO(x)              (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSCCFG_CO_SHIFT)) & MACSEC_MACSEC_RXSCCFG_CO_MASK)

#define MACSEC_MACSEC_RXSCCFG_VF_MASK            (0x300U)
#define MACSEC_MACSEC_RXSCCFG_VF_SHIFT           (8U)
#define MACSEC_MACSEC_RXSCCFG_VF_WIDTH           (2U)
#define MACSEC_MACSEC_RXSCCFG_VF(x)              (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSCCFG_VF_SHIFT)) & MACSEC_MACSEC_RXSCCFG_VF_MASK)

#define MACSEC_MACSEC_RXSCCFG_RP_MASK            (0x400U)
#define MACSEC_MACSEC_RXSCCFG_RP_SHIFT           (10U)
#define MACSEC_MACSEC_RXSCCFG_RP_WIDTH           (1U)
#define MACSEC_MACSEC_RXSCCFG_RP(x)              (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSCCFG_RP_SHIFT)) & MACSEC_MACSEC_RXSCCFG_RP_MASK)

#define MACSEC_MACSEC_RXSCCFG_SCI_EN_MASK        (0x800U)
#define MACSEC_MACSEC_RXSCCFG_SCI_EN_SHIFT       (11U)
#define MACSEC_MACSEC_RXSCCFG_SCI_EN_WIDTH       (1U)
#define MACSEC_MACSEC_RXSCCFG_SCI_EN(x)          (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSCCFG_SCI_EN_SHIFT)) & MACSEC_MACSEC_RXSCCFG_SCI_EN_MASK)

#define MACSEC_MACSEC_RXSCCFG_VID_MASK           (0xFFF000U)
#define MACSEC_MACSEC_RXSCCFG_VID_SHIFT          (12U)
#define MACSEC_MACSEC_RXSCCFG_VID_WIDTH          (12U)
#define MACSEC_MACSEC_RXSCCFG_VID(x)             (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSCCFG_VID_SHIFT)) & MACSEC_MACSEC_RXSCCFG_VID_MASK)

#define MACSEC_MACSEC_RXSCCFG_CS_MASK            (0x3000000U)
#define MACSEC_MACSEC_RXSCCFG_CS_SHIFT           (24U)
#define MACSEC_MACSEC_RXSCCFG_CS_WIDTH           (2U)
#define MACSEC_MACSEC_RXSCCFG_CS(x)              (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSCCFG_CS_SHIFT)) & MACSEC_MACSEC_RXSCCFG_CS_MASK)

#define MACSEC_MACSEC_RXSCCFG_NUM_TAGS_MASK      (0x60000000U)
#define MACSEC_MACSEC_RXSCCFG_NUM_TAGS_SHIFT     (29U)
#define MACSEC_MACSEC_RXSCCFG_NUM_TAGS_WIDTH     (2U)
#define MACSEC_MACSEC_RXSCCFG_NUM_TAGS(x)        (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSCCFG_NUM_TAGS_SHIFT)) & MACSEC_MACSEC_RXSCCFG_NUM_TAGS_MASK)

#define MACSEC_MACSEC_RXSCCFG_TAG_CE_MASK        (0x80000000U)
#define MACSEC_MACSEC_RXSCCFG_TAG_CE_SHIFT       (31U)
#define MACSEC_MACSEC_RXSCCFG_TAG_CE_WIDTH       (1U)
#define MACSEC_MACSEC_RXSCCFG_TAG_CE(x)          (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSCCFG_TAG_CE_SHIFT)) & MACSEC_MACSEC_RXSCCFG_TAG_CE_MASK)
/*! @} */

/*! @name MACSEC_RPW - replayWindow */
/*! @{ */

#define MACSEC_MACSEC_RPW_RPW_MASK               (0xFFFFFFFFU)
#define MACSEC_MACSEC_RPW_RPW_SHIFT              (0U)
#define MACSEC_MACSEC_RPW_RPW_WIDTH              (32U)
#define MACSEC_MACSEC_RPW_RPW(x)                 (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RPW_RPW_SHIFT)) & MACSEC_MACSEC_RPW_RPW_MASK)
/*! @} */

/*! @name MACSEC_INOV1HS - InOctetsValidated first half Statistic */
/*! @{ */

