zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MACSEC.h
#define MACSEC_MACSEC_INOV1HS_InOctetsValidated_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_INOV1HS_InOctetsValidated_SHIFT (0U)
#define MACSEC_MACSEC_INOV1HS_InOctetsValidated_WIDTH (32U)
#define MACSEC_MACSEC_INOV1HS_InOctetsValidated(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_INOV1HS_InOctetsValidated_SHIFT)) & MACSEC_MACSEC_INOV1HS_InOctetsValidated_MASK)
/*! @} */

/*! @name MACSEC_INOV2HS - InOctetsValidated second half Statistic */
/*! @{ */

#define MACSEC_MACSEC_INOV2HS_InOctetsValidated_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_INOV2HS_InOctetsValidated_SHIFT (0U)
#define MACSEC_MACSEC_INOV2HS_InOctetsValidated_WIDTH (32U)
#define MACSEC_MACSEC_INOV2HS_InOctetsValidated(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_INOV2HS_InOctetsValidated_SHIFT)) & MACSEC_MACSEC_INOV2HS_InOctetsValidated_MASK)
/*! @} */

/*! @name MACSEC_INOD1HS - InOctetsDecrypted first half Statistic */
/*! @{ */

#define MACSEC_MACSEC_INOD1HS_InOctetsDecrypted_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_INOD1HS_InOctetsDecrypted_SHIFT (0U)
#define MACSEC_MACSEC_INOD1HS_InOctetsDecrypted_WIDTH (32U)
#define MACSEC_MACSEC_INOD1HS_InOctetsDecrypted(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_INOD1HS_InOctetsDecrypted_SHIFT)) & MACSEC_MACSEC_INOD1HS_InOctetsDecrypted_MASK)
/*! @} */

/*! @name MACSEC_INOD2HS - InOctetsDecrypted second half Statistic */
/*! @{ */

#define MACSEC_MACSEC_INOD2HS_InOctetsDecrypted_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_INOD2HS_InOctetsDecrypted_SHIFT (0U)
#define MACSEC_MACSEC_INOD2HS_InOctetsDecrypted_WIDTH (32U)
#define MACSEC_MACSEC_INOD2HS_InOctetsDecrypted(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_INOD2HS_InOctetsDecrypted_SHIFT)) & MACSEC_MACSEC_INOD2HS_InOctetsDecrypted_MASK)
/*! @} */

/*! @name MACSEC_RXSCIPUS - RX Secure Channel InPktsUnchecked Statistic */
/*! @{ */

#define MACSEC_MACSEC_RXSCIPUS_InPktsUnchecked_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSCIPUS_InPktsUnchecked_SHIFT (0U)
#define MACSEC_MACSEC_RXSCIPUS_InPktsUnchecked_WIDTH (32U)
#define MACSEC_MACSEC_RXSCIPUS_InPktsUnchecked(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSCIPUS_InPktsUnchecked_SHIFT)) & MACSEC_MACSEC_RXSCIPUS_InPktsUnchecked_MASK)
/*! @} */

/*! @name MACSEC_RXSCIPDS - RX Secure Channel InPktsDelayed Statistic */
/*! @{ */

#define MACSEC_MACSEC_RXSCIPDS_InPktsDelayed_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSCIPDS_InPktsDelayed_SHIFT (0U)
#define MACSEC_MACSEC_RXSCIPDS_InPktsDelayed_WIDTH (32U)
#define MACSEC_MACSEC_RXSCIPDS_InPktsDelayed(x)  (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSCIPDS_InPktsDelayed_SHIFT)) & MACSEC_MACSEC_RXSCIPDS_InPktsDelayed_MASK)
/*! @} */

/*! @name MACSEC_RXSCIPLS - RX Secure Channel InPktsLate Statistic */
/*! @{ */

#define MACSEC_MACSEC_RXSCIPLS_InPktsLate_MASK   (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSCIPLS_InPktsLate_SHIFT  (0U)
#define MACSEC_MACSEC_RXSCIPLS_InPktsLate_WIDTH  (32U)
#define MACSEC_MACSEC_RXSCIPLS_InPktsLate(x)     (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSCIPLS_InPktsLate_SHIFT)) & MACSEC_MACSEC_RXSCIPLS_InPktsLate_MASK)
/*! @} */

/*! @name MACSEC_RXANINUSS - RX AN 0 InNotUsingSA Statistic..RX AN 3 InNotUsingSA Statistic */
/*! @{ */

#define MACSEC_MACSEC_RXANINUSS_InNotUsingSA_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXANINUSS_InNotUsingSA_SHIFT (0U)
#define MACSEC_MACSEC_RXANINUSS_InNotUsingSA_WIDTH (32U)
#define MACSEC_MACSEC_RXANINUSS_InNotUsingSA(x)  (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXANINUSS_InNotUsingSA_SHIFT)) & MACSEC_MACSEC_RXANINUSS_InNotUsingSA_MASK)
/*! @} */

/*! @name MACSEC_RXANIPUSS - RX AN 0 InPktsUnusedSA Statistic..RX AN 3 InPktsUnusedSA Statistic */
/*! @{ */

#define MACSEC_MACSEC_RXANIPUSS_InPktsUnusedSA_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXANIPUSS_InPktsUnusedSA_SHIFT (0U)
#define MACSEC_MACSEC_RXANIPUSS_InPktsUnusedSA_WIDTH (32U)
#define MACSEC_MACSEC_RXANIPUSS_InPktsUnusedSA(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXANIPUSS_InPktsUnusedSA_SHIFT)) & MACSEC_MACSEC_RXANIPUSS_InPktsUnusedSA_MASK)
/*! @} */

/*! @name MACSEC_RXSAACS - RX Security Association A configuration and status */
/*! @{ */

#define MACSEC_MACSEC_RXSAACS_EN_MASK            (0x1U)
#define MACSEC_MACSEC_RXSAACS_EN_SHIFT           (0U)
#define MACSEC_MACSEC_RXSAACS_EN_WIDTH           (1U)
#define MACSEC_MACSEC_RXSAACS_EN(x)              (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSAACS_EN_SHIFT)) & MACSEC_MACSEC_RXSAACS_EN_MASK)

#define MACSEC_MACSEC_RXSAACS_AN_MASK            (0x6U)
#define MACSEC_MACSEC_RXSAACS_AN_SHIFT           (1U)
#define MACSEC_MACSEC_RXSAACS_AN_WIDTH           (2U)
#define MACSEC_MACSEC_RXSAACS_AN(x)              (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSAACS_AN_SHIFT)) & MACSEC_MACSEC_RXSAACS_AN_MASK)

#define MACSEC_MACSEC_RXSAACS_A_MASK             (0x80000000U)
#define MACSEC_MACSEC_RXSAACS_A_SHIFT            (31U)
#define MACSEC_MACSEC_RXSAACS_A_WIDTH            (1U)
#define MACSEC_MACSEC_RXSAACS_A(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSAACS_A_SHIFT)) & MACSEC_MACSEC_RXSAACS_A_MASK)
/*! @} */

/*! @name MACSEC_RXSAANPN - RX Security Association A nextPN */
/*! @{ */

#define MACSEC_MACSEC_RXSAANPN_nextPN_MASK       (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSAANPN_nextPN_SHIFT      (0U)
#define MACSEC_MACSEC_RXSAANPN_nextPN_WIDTH      (32U)
#define MACSEC_MACSEC_RXSAANPN_nextPN(x)         (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSAANPN_nextPN_SHIFT)) & MACSEC_MACSEC_RXSAANPN_nextPN_MASK)
/*! @} */

/*! @name MACSEC_RXSAAXNPN - RX Security Association Extended A nextPN */
/*! @{ */

#define MACSEC_MACSEC_RXSAAXNPN_ext_nextPN_MASK  (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSAAXNPN_ext_nextPN_SHIFT (0U)
#define MACSEC_MACSEC_RXSAAXNPN_ext_nextPN_WIDTH (32U)
#define MACSEC_MACSEC_RXSAAXNPN_ext_nextPN(x)    (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSAAXNPN_ext_nextPN_SHIFT)) & MACSEC_MACSEC_RXSAAXNPN_ext_nextPN_MASK)
/*! @} */

/*! @name MACSEC_RXSAALPN - RX Security Association A lowestPN */
/*! @{ */

#define MACSEC_MACSEC_RXSAALPN_lowestPN_MASK     (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSAALPN_lowestPN_SHIFT    (0U)
#define MACSEC_MACSEC_RXSAALPN_lowestPN_WIDTH    (32U)
#define MACSEC_MACSEC_RXSAALPN_lowestPN(x)       (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSAALPN_lowestPN_SHIFT)) & MACSEC_MACSEC_RXSAALPN_lowestPN_MASK)
/*! @} */

/*! @name MACSEC_RXSAAXLPN - RX Security Association Extended A lowestPN */
/*! @{ */

#define MACSEC_MACSEC_RXSAAXLPN_ext_lowestPN_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSAAXLPN_ext_lowestPN_SHIFT (0U)
#define MACSEC_MACSEC_RXSAAXLPN_ext_lowestPN_WIDTH (32U)
#define MACSEC_MACSEC_RXSAAXLPN_ext_lowestPN(x)  (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSAAXLPN_ext_lowestPN_SHIFT)) & MACSEC_MACSEC_RXSAAXLPN_ext_lowestPN_MASK)
/*! @} */

/*! @name MACSEC_RXSAAIPOS - RX Security Association A InPktsOK Statistic */
/*! @{ */

#define MACSEC_MACSEC_RXSAAIPOS_InPktsOK_MASK    (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSAAIPOS_InPktsOK_SHIFT   (0U)
#define MACSEC_MACSEC_RXSAAIPOS_InPktsOK_WIDTH   (32U)
#define MACSEC_MACSEC_RXSAAIPOS_InPktsOK(x)      (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSAAIPOS_InPktsOK_SHIFT)) & MACSEC_MACSEC_RXSAAIPOS_InPktsOK_MASK)
/*! @} */

/*! @name MACSEC_RXSAAIPIS - RX Security Association A InPktsInvalid Statistic */
/*! @{ */

#define MACSEC_MACSEC_RXSAAIPIS_InPktsInvalid_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSAAIPIS_InPktsInvalid_SHIFT (0U)
#define MACSEC_MACSEC_RXSAAIPIS_InPktsInvalid_WIDTH (32U)
#define MACSEC_MACSEC_RXSAAIPIS_InPktsInvalid(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSAAIPIS_InPktsInvalid_SHIFT)) & MACSEC_MACSEC_RXSAAIPIS_InPktsInvalid_MASK)
/*! @} */

/*! @name MACSEC_RXSAAIPNVS - RX Security Association A InPktsNotValid Statistic */
/*! @{ */

#define MACSEC_MACSEC_RXSAAIPNVS_InPktsNotValid_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSAAIPNVS_InPktsNotValid_SHIFT (0U)
#define MACSEC_MACSEC_RXSAAIPNVS_InPktsNotValid_WIDTH (32U)
#define MACSEC_MACSEC_RXSAAIPNVS_InPktsNotValid(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSAAIPNVS_InPktsNotValid_SHIFT)) & MACSEC_MACSEC_RXSAAIPNVS_InPktsNotValid_MASK)
/*! @} */

/*! @name MACSEC_RXSABCS - RX Security Association B configuration and status */
/*! @{ */

#define MACSEC_MACSEC_RXSABCS_EN_MASK            (0x1U)
#define MACSEC_MACSEC_RXSABCS_EN_SHIFT           (0U)
#define MACSEC_MACSEC_RXSABCS_EN_WIDTH           (1U)
#define MACSEC_MACSEC_RXSABCS_EN(x)              (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSABCS_EN_SHIFT)) & MACSEC_MACSEC_RXSABCS_EN_MASK)

