zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MACSEC.h
#define MACSEC_MACSEC_RXSABCS_AN_MASK            (0x6U)
#define MACSEC_MACSEC_RXSABCS_AN_SHIFT           (1U)
#define MACSEC_MACSEC_RXSABCS_AN_WIDTH           (2U)
#define MACSEC_MACSEC_RXSABCS_AN(x)              (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSABCS_AN_SHIFT)) & MACSEC_MACSEC_RXSABCS_AN_MASK)

#define MACSEC_MACSEC_RXSABCS_A_MASK             (0x80000000U)
#define MACSEC_MACSEC_RXSABCS_A_SHIFT            (31U)
#define MACSEC_MACSEC_RXSABCS_A_WIDTH            (1U)
#define MACSEC_MACSEC_RXSABCS_A(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSABCS_A_SHIFT)) & MACSEC_MACSEC_RXSABCS_A_MASK)
/*! @} */

/*! @name MACSEC_RXSABNPN - RX Security Association B nextPN */
/*! @{ */

#define MACSEC_MACSEC_RXSABNPN_nextPN_MASK       (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSABNPN_nextPN_SHIFT      (0U)
#define MACSEC_MACSEC_RXSABNPN_nextPN_WIDTH      (32U)
#define MACSEC_MACSEC_RXSABNPN_nextPN(x)         (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSABNPN_nextPN_SHIFT)) & MACSEC_MACSEC_RXSABNPN_nextPN_MASK)
/*! @} */

/*! @name MACSEC_RXSABXNPN - RX Security Association Extended B nextPN */
/*! @{ */

#define MACSEC_MACSEC_RXSABXNPN_ext_nextPN_MASK  (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSABXNPN_ext_nextPN_SHIFT (0U)
#define MACSEC_MACSEC_RXSABXNPN_ext_nextPN_WIDTH (32U)
#define MACSEC_MACSEC_RXSABXNPN_ext_nextPN(x)    (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSABXNPN_ext_nextPN_SHIFT)) & MACSEC_MACSEC_RXSABXNPN_ext_nextPN_MASK)
/*! @} */

/*! @name MACSEC_RXSABLPN - RX Security Association B lowestPN */
/*! @{ */

#define MACSEC_MACSEC_RXSABLPN_lowestPN_MASK     (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSABLPN_lowestPN_SHIFT    (0U)
#define MACSEC_MACSEC_RXSABLPN_lowestPN_WIDTH    (32U)
#define MACSEC_MACSEC_RXSABLPN_lowestPN(x)       (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSABLPN_lowestPN_SHIFT)) & MACSEC_MACSEC_RXSABLPN_lowestPN_MASK)
/*! @} */

/*! @name MACSEC_RXSABXLPN - RX Security Association Extended B lowestPN */
/*! @{ */

#define MACSEC_MACSEC_RXSABXLPN_ext_lowestPN_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSABXLPN_ext_lowestPN_SHIFT (0U)
#define MACSEC_MACSEC_RXSABXLPN_ext_lowestPN_WIDTH (32U)
#define MACSEC_MACSEC_RXSABXLPN_ext_lowestPN(x)  (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSABXLPN_ext_lowestPN_SHIFT)) & MACSEC_MACSEC_RXSABXLPN_ext_lowestPN_MASK)
/*! @} */

/*! @name MACSEC_RXSABIPOS - RX Security Association B InPktsOK Statistic */
/*! @{ */

#define MACSEC_MACSEC_RXSABIPOS_InPktsOK_MASK    (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSABIPOS_InPktsOK_SHIFT   (0U)
#define MACSEC_MACSEC_RXSABIPOS_InPktsOK_WIDTH   (32U)
#define MACSEC_MACSEC_RXSABIPOS_InPktsOK(x)      (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSABIPOS_InPktsOK_SHIFT)) & MACSEC_MACSEC_RXSABIPOS_InPktsOK_MASK)
/*! @} */

/*! @name MACSEC_RXSABIPIS - RX Security Association B InPktsInvalid Statistic */
/*! @{ */

#define MACSEC_MACSEC_RXSABIPIS_InPktsInvalid_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSABIPIS_InPktsInvalid_SHIFT (0U)
#define MACSEC_MACSEC_RXSABIPIS_InPktsInvalid_WIDTH (32U)
#define MACSEC_MACSEC_RXSABIPIS_InPktsInvalid(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSABIPIS_InPktsInvalid_SHIFT)) & MACSEC_MACSEC_RXSABIPIS_InPktsInvalid_MASK)
/*! @} */

/*! @name MACSEC_RXSABIPNVS - RX Security Association B InPktsNotValid Statistic */
/*! @{ */

#define MACSEC_MACSEC_RXSABIPNVS_InPktsNotValid_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSABIPNVS_InPktsNotValid_SHIFT (0U)
#define MACSEC_MACSEC_RXSABIPNVS_InPktsNotValid_WIDTH (32U)
#define MACSEC_MACSEC_RXSABIPNVS_InPktsNotValid(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSABIPNVS_InPktsNotValid_SHIFT)) & MACSEC_MACSEC_RXSABIPNVS_InPktsNotValid_MASK)
/*! @} */

/*! @name MACSEC_TXSCI1H - TX Secure Channel Identifier first half */
/*! @{ */

#define MACSEC_MACSEC_TXSCI1H_TXSCI_MASK         (0xFFFFFFFFU)
#define MACSEC_MACSEC_TXSCI1H_TXSCI_SHIFT        (0U)
#define MACSEC_MACSEC_TXSCI1H_TXSCI_WIDTH        (32U)
#define MACSEC_MACSEC_TXSCI1H_TXSCI(x)           (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCI1H_TXSCI_SHIFT)) & MACSEC_MACSEC_TXSCI1H_TXSCI_MASK)
/*! @} */

/*! @name MACSEC_TXSCI2H - TX Secure Channel Identifier second half */
/*! @{ */

#define MACSEC_MACSEC_TXSCI2H_TXSCI_MASK         (0xFFFFFFFFU)
#define MACSEC_MACSEC_TXSCI2H_TXSCI_SHIFT        (0U)
#define MACSEC_MACSEC_TXSCI2H_TXSCI_WIDTH        (32U)
#define MACSEC_MACSEC_TXSCI2H_TXSCI(x)           (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCI2H_TXSCI_SHIFT)) & MACSEC_MACSEC_TXSCI2H_TXSCI_MASK)
/*! @} */

/*! @name MACSEC_IFOO1HS - ifOutOctets first half Statistic */
/*! @{ */

#define MACSEC_MACSEC_IFOO1HS_ifOutOctets_MASK   (0xFFFFFFFFU)
#define MACSEC_MACSEC_IFOO1HS_ifOutOctets_SHIFT  (0U)
#define MACSEC_MACSEC_IFOO1HS_ifOutOctets_WIDTH  (32U)
#define MACSEC_MACSEC_IFOO1HS_ifOutOctets(x)     (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IFOO1HS_ifOutOctets_SHIFT)) & MACSEC_MACSEC_IFOO1HS_ifOutOctets_MASK)
/*! @} */

/*! @name MACSEC_IFOO2HS - ifOutOctets second half Statistic */
/*! @{ */

#define MACSEC_MACSEC_IFOO2HS_ifOutOctets_MASK   (0xFFFFFFFFU)
#define MACSEC_MACSEC_IFOO2HS_ifOutOctets_SHIFT  (0U)
#define MACSEC_MACSEC_IFOO2HS_ifOutOctets_WIDTH  (32U)
#define MACSEC_MACSEC_IFOO2HS_ifOutOctets(x)     (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IFOO2HS_ifOutOctets_SHIFT)) & MACSEC_MACSEC_IFOO2HS_ifOutOctets_MASK)
/*! @} */

/*! @name MACSEC_IFOUPS - ifOutUcastPkts Statistic */
/*! @{ */

#define MACSEC_MACSEC_IFOUPS_ifOutUcastPkts_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_IFOUPS_ifOutUcastPkts_SHIFT (0U)
#define MACSEC_MACSEC_IFOUPS_ifOutUcastPkts_WIDTH (32U)
#define MACSEC_MACSEC_IFOUPS_ifOutUcastPkts(x)   (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IFOUPS_ifOutUcastPkts_SHIFT)) & MACSEC_MACSEC_IFOUPS_ifOutUcastPkts_MASK)
/*! @} */

/*! @name MACSEC_OPUS - OutPktsUntagged Statistic */
/*! @{ */

#define MACSEC_MACSEC_OPUS_OutPktsUntagged_MASK  (0xFFFFFFFFU)
#define MACSEC_MACSEC_OPUS_OutPktsUntagged_SHIFT (0U)
#define MACSEC_MACSEC_OPUS_OutPktsUntagged_WIDTH (32U)
#define MACSEC_MACSEC_OPUS_OutPktsUntagged(x)    (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_OPUS_OutPktsUntagged_SHIFT)) & MACSEC_MACSEC_OPUS_OutPktsUntagged_MASK)
/*! @} */

/*! @name MACSEC_IFOMPS - ifOutMulticastPkts Statistic */
/*! @{ */

#define MACSEC_MACSEC_IFOMPS_ifOutMulticastPkts_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_IFOMPS_ifOutMulticastPkts_SHIFT (0U)
#define MACSEC_MACSEC_IFOMPS_ifOutMulticastPkts_WIDTH (32U)
#define MACSEC_MACSEC_IFOMPS_ifOutMulticastPkts(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IFOMPS_ifOutMulticastPkts_SHIFT)) & MACSEC_MACSEC_IFOMPS_ifOutMulticastPkts_MASK)
/*! @} */

/*! @name MACSEC_IFOBPS - ifOutBroadcastPkts Statistic */
/*! @{ */

#define MACSEC_MACSEC_IFOBPS_ifOutBroadcastPkts_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_IFOBPS_ifOutBroadcastPkts_SHIFT (0U)
#define MACSEC_MACSEC_IFOBPS_ifOutBroadcastPkts_WIDTH (32U)
#define MACSEC_MACSEC_IFOBPS_ifOutBroadcastPkts(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IFOBPS_ifOutBroadcastPkts_SHIFT)) & MACSEC_MACSEC_IFOBPS_ifOutBroadcastPkts_MASK)
/*! @} */

/*! @name MACSEC_TXSCCFG - TX Secure Channel configuration */
/*! @{ */

#define MACSEC_MACSEC_TXSCCFG_USCB_MASK          (0x1U)
#define MACSEC_MACSEC_TXSCCFG_USCB_SHIFT         (0U)
#define MACSEC_MACSEC_TXSCCFG_USCB_WIDTH         (1U)
#define MACSEC_MACSEC_TXSCCFG_USCB(x)            (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCCFG_USCB_SHIFT)) & MACSEC_MACSEC_TXSCCFG_USCB_MASK)

#define MACSEC_MACSEC_TXSCCFG_UES_MASK           (0x2U)
#define MACSEC_MACSEC_TXSCCFG_UES_SHIFT          (1U)
#define MACSEC_MACSEC_TXSCCFG_UES_WIDTH          (1U)
#define MACSEC_MACSEC_TXSCCFG_UES(x)             (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCCFG_UES_SHIFT)) & MACSEC_MACSEC_TXSCCFG_UES_MASK)

#define MACSEC_MACSEC_TXSCCFG_AIS_MASK           (0x4U)
#define MACSEC_MACSEC_TXSCCFG_AIS_SHIFT          (2U)
#define MACSEC_MACSEC_TXSCCFG_AIS_WIDTH          (1U)
#define MACSEC_MACSEC_TXSCCFG_AIS(x)             (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCCFG_AIS_SHIFT)) & MACSEC_MACSEC_TXSCCFG_AIS_MASK)

#define MACSEC_MACSEC_TXSCCFG_PF_MASK            (0x8U)
#define MACSEC_MACSEC_TXSCCFG_PF_SHIFT           (3U)
#define MACSEC_MACSEC_TXSCCFG_PF_WIDTH           (1U)
#define MACSEC_MACSEC_TXSCCFG_PF(x)              (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCCFG_PF_SHIFT)) & MACSEC_MACSEC_TXSCCFG_PF_MASK)

#define MACSEC_MACSEC_TXSCCFG_CE_MASK            (0x10U)
#define MACSEC_MACSEC_TXSCCFG_CE_SHIFT           (4U)
#define MACSEC_MACSEC_TXSCCFG_CE_WIDTH           (1U)
#define MACSEC_MACSEC_TXSCCFG_CE(x)              (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCCFG_CE_SHIFT)) & MACSEC_MACSEC_TXSCCFG_CE_MASK)

#define MACSEC_MACSEC_TXSCCFG_CO_MASK            (0x3F00U)
#define MACSEC_MACSEC_TXSCCFG_CO_SHIFT           (8U)
#define MACSEC_MACSEC_TXSCCFG_CO_WIDTH           (6U)
#define MACSEC_MACSEC_TXSCCFG_CO(x)              (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCCFG_CO_SHIFT)) & MACSEC_MACSEC_TXSCCFG_CO_MASK)

#define MACSEC_MACSEC_TXSCCFG_SCE_MASK           (0x10000U)
#define MACSEC_MACSEC_TXSCCFG_SCE_SHIFT          (16U)
#define MACSEC_MACSEC_TXSCCFG_SCE_WIDTH          (1U)
#define MACSEC_MACSEC_TXSCCFG_SCE(x)             (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCCFG_SCE_SHIFT)) & MACSEC_MACSEC_TXSCCFG_SCE_MASK)

