zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MACSEC.h
#define MACSEC_MACSEC_TXSCCFG_ASA_MASK           (0x20000U)
#define MACSEC_MACSEC_TXSCCFG_ASA_SHIFT          (17U)
#define MACSEC_MACSEC_TXSCCFG_ASA_WIDTH          (1U)
#define MACSEC_MACSEC_TXSCCFG_ASA(x)             (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCCFG_ASA_SHIFT)) & MACSEC_MACSEC_TXSCCFG_ASA_MASK)

#define MACSEC_MACSEC_TXSCCFG_AN_MASK            (0xC0000U)
#define MACSEC_MACSEC_TXSCCFG_AN_SHIFT           (18U)
#define MACSEC_MACSEC_TXSCCFG_AN_WIDTH           (2U)
#define MACSEC_MACSEC_TXSCCFG_AN(x)              (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCCFG_AN_SHIFT)) & MACSEC_MACSEC_TXSCCFG_AN_MASK)

#define MACSEC_MACSEC_TXSCCFG_CS_MASK            (0x3000000U)
#define MACSEC_MACSEC_TXSCCFG_CS_SHIFT           (24U)
#define MACSEC_MACSEC_TXSCCFG_CS_WIDTH           (2U)
#define MACSEC_MACSEC_TXSCCFG_CS(x)              (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCCFG_CS_SHIFT)) & MACSEC_MACSEC_TXSCCFG_CS_MASK)

#define MACSEC_MACSEC_TXSCCFG_TVM_MASK           (0x30000000U)
#define MACSEC_MACSEC_TXSCCFG_TVM_SHIFT          (28U)
#define MACSEC_MACSEC_TXSCCFG_TVM_WIDTH          (2U)
#define MACSEC_MACSEC_TXSCCFG_TVM(x)             (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCCFG_TVM_SHIFT)) & MACSEC_MACSEC_TXSCCFG_TVM_MASK)

#define MACSEC_MACSEC_TXSCCFG_TCM_MASK           (0x40000000U)
#define MACSEC_MACSEC_TXSCCFG_TCM_SHIFT          (30U)
#define MACSEC_MACSEC_TXSCCFG_TCM_WIDTH          (1U)
#define MACSEC_MACSEC_TXSCCFG_TCM(x)             (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCCFG_TCM_SHIFT)) & MACSEC_MACSEC_TXSCCFG_TCM_MASK)
/*! @} */

/*! @name MACSEC_OPTLS - OutPktsTooLong Statistic */
/*! @{ */

#define MACSEC_MACSEC_OPTLS_OutPktsTooLong_MASK  (0xFFFFFFFFU)
#define MACSEC_MACSEC_OPTLS_OutPktsTooLong_SHIFT (0U)
#define MACSEC_MACSEC_OPTLS_OutPktsTooLong_WIDTH (32U)
#define MACSEC_MACSEC_OPTLS_OutPktsTooLong(x)    (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_OPTLS_OutPktsTooLong_SHIFT)) & MACSEC_MACSEC_OPTLS_OutPktsTooLong_MASK)
/*! @} */

/*! @name MACSEC_OOP1HS - OutOctetsProtected first half Statistic */
/*! @{ */

#define MACSEC_MACSEC_OOP1HS_OutOctetsProtected_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_OOP1HS_OutOctetsProtected_SHIFT (0U)
#define MACSEC_MACSEC_OOP1HS_OutOctetsProtected_WIDTH (32U)
#define MACSEC_MACSEC_OOP1HS_OutOctetsProtected(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_OOP1HS_OutOctetsProtected_SHIFT)) & MACSEC_MACSEC_OOP1HS_OutOctetsProtected_MASK)
/*! @} */

/*! @name MACSEC_OOP2HS - OutOctetsProtected second half Statistic */
/*! @{ */

#define MACSEC_MACSEC_OOP2HS_OutOctetsProtected_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_OOP2HS_OutOctetsProtected_SHIFT (0U)
#define MACSEC_MACSEC_OOP2HS_OutOctetsProtected_WIDTH (32U)
#define MACSEC_MACSEC_OOP2HS_OutOctetsProtected(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_OOP2HS_OutOctetsProtected_SHIFT)) & MACSEC_MACSEC_OOP2HS_OutOctetsProtected_MASK)
/*! @} */

/*! @name MACSEC_OOE1HS - OutOctetsEncrypted first half Statistic */
/*! @{ */

#define MACSEC_MACSEC_OOE1HS_OutOctetsEncrypted_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_OOE1HS_OutOctetsEncrypted_SHIFT (0U)
#define MACSEC_MACSEC_OOE1HS_OutOctetsEncrypted_WIDTH (32U)
#define MACSEC_MACSEC_OOE1HS_OutOctetsEncrypted(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_OOE1HS_OutOctetsEncrypted_SHIFT)) & MACSEC_MACSEC_OOE1HS_OutOctetsEncrypted_MASK)
/*! @} */

/*! @name MACSEC_OOE2HS - OutOctetsEncrypted second half Statistic */
/*! @{ */

#define MACSEC_MACSEC_OOE2HS_OutOctetsEncrypted_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_OOE2HS_OutOctetsEncrypted_SHIFT (0U)
#define MACSEC_MACSEC_OOE2HS_OutOctetsEncrypted_WIDTH (32U)
#define MACSEC_MACSEC_OOE2HS_OutOctetsEncrypted(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_OOE2HS_OutOctetsEncrypted_SHIFT)) & MACSEC_MACSEC_OOE2HS_OutOctetsEncrypted_MASK)
/*! @} */

/*! @name MACSEC_TXSAACS - TX Security Association A configuration and status */
/*! @{ */

#define MACSEC_MACSEC_TXSAACS_A_MASK             (0x80000000U)
#define MACSEC_MACSEC_TXSAACS_A_SHIFT            (31U)
#define MACSEC_MACSEC_TXSAACS_A_WIDTH            (1U)
#define MACSEC_MACSEC_TXSAACS_A(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSAACS_A_SHIFT)) & MACSEC_MACSEC_TXSAACS_A_MASK)
/*! @} */

/*! @name MACSEC_TXSAANPN - TX Security Association A nextPN */
/*! @{ */

#define MACSEC_MACSEC_TXSAANPN_nextPN_MASK       (0xFFFFFFFFU)
#define MACSEC_MACSEC_TXSAANPN_nextPN_SHIFT      (0U)
#define MACSEC_MACSEC_TXSAANPN_nextPN_WIDTH      (32U)
#define MACSEC_MACSEC_TXSAANPN_nextPN(x)         (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSAANPN_nextPN_SHIFT)) & MACSEC_MACSEC_TXSAANPN_nextPN_MASK)
/*! @} */

/*! @name MACSEC_TXSAAXNPN - TX Security Association Extended A nextPN */
/*! @{ */

#define MACSEC_MACSEC_TXSAAXNPN_ext_nextPN_MASK  (0xFFFFFFFFU)
#define MACSEC_MACSEC_TXSAAXNPN_ext_nextPN_SHIFT (0U)
#define MACSEC_MACSEC_TXSAAXNPN_ext_nextPN_WIDTH (32U)
#define MACSEC_MACSEC_TXSAAXNPN_ext_nextPN(x)    (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSAAXNPN_ext_nextPN_SHIFT)) & MACSEC_MACSEC_TXSAAXNPN_ext_nextPN_MASK)
/*! @} */

/*! @name MACSEC_TXSAAOPPS - TX Security Association A OutPktsProtected Statistic */
/*! @{ */

#define MACSEC_MACSEC_TXSAAOPPS_OutPktsProtected_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_TXSAAOPPS_OutPktsProtected_SHIFT (0U)
#define MACSEC_MACSEC_TXSAAOPPS_OutPktsProtected_WIDTH (32U)
#define MACSEC_MACSEC_TXSAAOPPS_OutPktsProtected(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSAAOPPS_OutPktsProtected_SHIFT)) & MACSEC_MACSEC_TXSAAOPPS_OutPktsProtected_MASK)
/*! @} */

/*! @name MACSEC_TXSAAOPES - TX Security Association A OutPktsEncrypted Statistic */
/*! @{ */

#define MACSEC_MACSEC_TXSAAOPES_OutPktsEncrypted_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_TXSAAOPES_OutPktsEncrypted_SHIFT (0U)
#define MACSEC_MACSEC_TXSAAOPES_OutPktsEncrypted_WIDTH (32U)
#define MACSEC_MACSEC_TXSAAOPES_OutPktsEncrypted(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSAAOPES_OutPktsEncrypted_SHIFT)) & MACSEC_MACSEC_TXSAAOPES_OutPktsEncrypted_MASK)
/*! @} */

/*! @name MACSEC_TXSABCS - TX Security Association B configuration and status */
/*! @{ */

#define MACSEC_MACSEC_TXSABCS_A_MASK             (0x80000000U)
#define MACSEC_MACSEC_TXSABCS_A_SHIFT            (31U)
#define MACSEC_MACSEC_TXSABCS_A_WIDTH            (1U)
#define MACSEC_MACSEC_TXSABCS_A(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSABCS_A_SHIFT)) & MACSEC_MACSEC_TXSABCS_A_MASK)
/*! @} */

/*! @name MACSEC_TXSABNPN - TX Security Association B nextPN */
/*! @{ */

#define MACSEC_MACSEC_TXSABNPN_nextPN_MASK       (0xFFFFFFFFU)
#define MACSEC_MACSEC_TXSABNPN_nextPN_SHIFT      (0U)
#define MACSEC_MACSEC_TXSABNPN_nextPN_WIDTH      (32U)
#define MACSEC_MACSEC_TXSABNPN_nextPN(x)         (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSABNPN_nextPN_SHIFT)) & MACSEC_MACSEC_TXSABNPN_nextPN_MASK)
/*! @} */

/*! @name MACSEC_TXSABXNPN - TX Security Association Extended B nextPN */
/*! @{ */

#define MACSEC_MACSEC_TXSABXNPN_ext_nextPN_MASK  (0xFFFFFFFFU)
#define MACSEC_MACSEC_TXSABXNPN_ext_nextPN_SHIFT (0U)
#define MACSEC_MACSEC_TXSABXNPN_ext_nextPN_WIDTH (32U)
#define MACSEC_MACSEC_TXSABXNPN_ext_nextPN(x)    (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSABXNPN_ext_nextPN_SHIFT)) & MACSEC_MACSEC_TXSABXNPN_ext_nextPN_MASK)
/*! @} */

/*! @name MACSEC_TXSABOPPS - TX Security Association B OutPktsProtected Statistic */
/*! @{ */

