zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MACSEC.h
#define MACSEC_MACSEC_TXSABOPPS_OutPktsProtected_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_TXSABOPPS_OutPktsProtected_SHIFT (0U)
#define MACSEC_MACSEC_TXSABOPPS_OutPktsProtected_WIDTH (32U)
#define MACSEC_MACSEC_TXSABOPPS_OutPktsProtected(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSABOPPS_OutPktsProtected_SHIFT)) & MACSEC_MACSEC_TXSABOPPS_OutPktsProtected_MASK)
/*! @} */

/*! @name MACSEC_TXSABOPES - TX Security Association B OutPktsEncrypted Statistic */
/*! @{ */

#define MACSEC_MACSEC_TXSABOPES_OutPktsEncrypted_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_TXSABOPES_OutPktsEncrypted_SHIFT (0U)
#define MACSEC_MACSEC_TXSABOPES_OutPktsEncrypted_WIDTH (32U)
#define MACSEC_MACSEC_TXSABOPES_OutPktsEncrypted(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSABOPES_OutPktsEncrypted_SHIFT)) & MACSEC_MACSEC_TXSABOPES_OutPktsEncrypted_MASK)
/*! @} */

/*! @name MACSEC_IP_REV_1 - MACsec IP Block Revision 1 register */
/*! @{ */

#define MACSEC_MACSEC_IP_REV_1_IP_MN_MASK        (0xFFU)
#define MACSEC_MACSEC_IP_REV_1_IP_MN_SHIFT       (0U)
#define MACSEC_MACSEC_IP_REV_1_IP_MN_WIDTH       (8U)
#define MACSEC_MACSEC_IP_REV_1_IP_MN(x)          (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IP_REV_1_IP_MN_SHIFT)) & MACSEC_MACSEC_IP_REV_1_IP_MN_MASK)

#define MACSEC_MACSEC_IP_REV_1_IP_MJ_MASK        (0xFF00U)
#define MACSEC_MACSEC_IP_REV_1_IP_MJ_SHIFT       (8U)
#define MACSEC_MACSEC_IP_REV_1_IP_MJ_WIDTH       (8U)
#define MACSEC_MACSEC_IP_REV_1_IP_MJ(x)          (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IP_REV_1_IP_MJ_SHIFT)) & MACSEC_MACSEC_IP_REV_1_IP_MJ_MASK)

#define MACSEC_MACSEC_IP_REV_1_IP_ID_MASK        (0xFFFF0000U)
#define MACSEC_MACSEC_IP_REV_1_IP_ID_SHIFT       (16U)
#define MACSEC_MACSEC_IP_REV_1_IP_ID_WIDTH       (16U)
#define MACSEC_MACSEC_IP_REV_1_IP_ID(x)          (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IP_REV_1_IP_ID_SHIFT)) & MACSEC_MACSEC_IP_REV_1_IP_ID_MASK)
/*! @} */

/*! @name MACSEC_IP_REV_2 - MACsec IP Block Revision 2 register */
/*! @{ */

#define MACSEC_MACSEC_IP_REV_2_IP_CFG_MASK       (0xFFU)
#define MACSEC_MACSEC_IP_REV_2_IP_CFG_SHIFT      (0U)
#define MACSEC_MACSEC_IP_REV_2_IP_CFG_WIDTH      (8U)
#define MACSEC_MACSEC_IP_REV_2_IP_CFG(x)         (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IP_REV_2_IP_CFG_SHIFT)) & MACSEC_MACSEC_IP_REV_2_IP_CFG_MASK)

#define MACSEC_MACSEC_IP_REV_2_IP_ERR_MASK       (0xFF00U)
#define MACSEC_MACSEC_IP_REV_2_IP_ERR_SHIFT      (8U)
#define MACSEC_MACSEC_IP_REV_2_IP_ERR_WIDTH      (8U)
#define MACSEC_MACSEC_IP_REV_2_IP_ERR(x)         (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IP_REV_2_IP_ERR_SHIFT)) & MACSEC_MACSEC_IP_REV_2_IP_ERR_MASK)

#define MACSEC_MACSEC_IP_REV_2_IP_INT_MASK       (0xFF0000U)
#define MACSEC_MACSEC_IP_REV_2_IP_INT_SHIFT      (16U)
#define MACSEC_MACSEC_IP_REV_2_IP_INT_WIDTH      (8U)
#define MACSEC_MACSEC_IP_REV_2_IP_INT(x)         (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IP_REV_2_IP_INT_SHIFT)) & MACSEC_MACSEC_IP_REV_2_IP_INT_MASK)
/*! @} */

/*! @name MACSEC_EVR - MACsec Event Register */
/*! @{ */

#define MACSEC_MACSEC_EVR_TS7R_MASK              (0x1000000U)
#define MACSEC_MACSEC_EVR_TS7R_SHIFT             (24U)
#define MACSEC_MACSEC_EVR_TS7R_WIDTH             (1U)
#define MACSEC_MACSEC_EVR_TS7R(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_EVR_TS7R_SHIFT)) & MACSEC_MACSEC_EVR_TS7R_MASK)

#define MACSEC_MACSEC_EVR_TS6R_MASK              (0x2000000U)
#define MACSEC_MACSEC_EVR_TS6R_SHIFT             (25U)
#define MACSEC_MACSEC_EVR_TS6R_WIDTH             (1U)
#define MACSEC_MACSEC_EVR_TS6R(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_EVR_TS6R_SHIFT)) & MACSEC_MACSEC_EVR_TS6R_MASK)

#define MACSEC_MACSEC_EVR_TS5R_MASK              (0x4000000U)
#define MACSEC_MACSEC_EVR_TS5R_SHIFT             (26U)
#define MACSEC_MACSEC_EVR_TS5R_WIDTH             (1U)
#define MACSEC_MACSEC_EVR_TS5R(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_EVR_TS5R_SHIFT)) & MACSEC_MACSEC_EVR_TS5R_MASK)

#define MACSEC_MACSEC_EVR_TS4R_MASK              (0x8000000U)
#define MACSEC_MACSEC_EVR_TS4R_SHIFT             (27U)
#define MACSEC_MACSEC_EVR_TS4R_WIDTH             (1U)
#define MACSEC_MACSEC_EVR_TS4R(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_EVR_TS4R_SHIFT)) & MACSEC_MACSEC_EVR_TS4R_MASK)

#define MACSEC_MACSEC_EVR_TS3R_MASK              (0x10000000U)
#define MACSEC_MACSEC_EVR_TS3R_SHIFT             (28U)
#define MACSEC_MACSEC_EVR_TS3R_WIDTH             (1U)
#define MACSEC_MACSEC_EVR_TS3R(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_EVR_TS3R_SHIFT)) & MACSEC_MACSEC_EVR_TS3R_MASK)

#define MACSEC_MACSEC_EVR_TS2R_MASK              (0x20000000U)
#define MACSEC_MACSEC_EVR_TS2R_SHIFT             (29U)
#define MACSEC_MACSEC_EVR_TS2R_WIDTH             (1U)
#define MACSEC_MACSEC_EVR_TS2R(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_EVR_TS2R_SHIFT)) & MACSEC_MACSEC_EVR_TS2R_MASK)

#define MACSEC_MACSEC_EVR_TS1R_MASK              (0x40000000U)
#define MACSEC_MACSEC_EVR_TS1R_SHIFT             (30U)
#define MACSEC_MACSEC_EVR_TS1R_WIDTH             (1U)
#define MACSEC_MACSEC_EVR_TS1R(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_EVR_TS1R_SHIFT)) & MACSEC_MACSEC_EVR_TS1R_MASK)

#define MACSEC_MACSEC_EVR_TS0R_MASK              (0x80000000U)
#define MACSEC_MACSEC_EVR_TS0R_SHIFT             (31U)
#define MACSEC_MACSEC_EVR_TS0R_WIDTH             (1U)
#define MACSEC_MACSEC_EVR_TS0R(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_EVR_TS0R_SHIFT)) & MACSEC_MACSEC_EVR_TS0R_MASK)
/*! @} */

/*! @name MACSEC_EVER - MACsec Event Enable Register */
/*! @{ */

#define MACSEC_MACSEC_EVER_TS7R_MASK             (0x1000000U)
#define MACSEC_MACSEC_EVER_TS7R_SHIFT            (24U)
#define MACSEC_MACSEC_EVER_TS7R_WIDTH            (1U)
#define MACSEC_MACSEC_EVER_TS7R(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_EVER_TS7R_SHIFT)) & MACSEC_MACSEC_EVER_TS7R_MASK)

#define MACSEC_MACSEC_EVER_TS6R_MASK             (0x2000000U)
#define MACSEC_MACSEC_EVER_TS6R_SHIFT            (25U)
#define MACSEC_MACSEC_EVER_TS6R_WIDTH            (1U)
#define MACSEC_MACSEC_EVER_TS6R(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_EVER_TS6R_SHIFT)) & MACSEC_MACSEC_EVER_TS6R_MASK)

#define MACSEC_MACSEC_EVER_TS5R_MASK             (0x4000000U)
#define MACSEC_MACSEC_EVER_TS5R_SHIFT            (26U)
#define MACSEC_MACSEC_EVER_TS5R_WIDTH            (1U)
#define MACSEC_MACSEC_EVER_TS5R(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_EVER_TS5R_SHIFT)) & MACSEC_MACSEC_EVER_TS5R_MASK)

#define MACSEC_MACSEC_EVER_TS4R_MASK             (0x8000000U)
#define MACSEC_MACSEC_EVER_TS4R_SHIFT            (27U)
#define MACSEC_MACSEC_EVER_TS4R_WIDTH            (1U)
#define MACSEC_MACSEC_EVER_TS4R(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_EVER_TS4R_SHIFT)) & MACSEC_MACSEC_EVER_TS4R_MASK)

#define MACSEC_MACSEC_EVER_TS3R_MASK             (0x10000000U)
#define MACSEC_MACSEC_EVER_TS3R_SHIFT            (28U)
#define MACSEC_MACSEC_EVER_TS3R_WIDTH            (1U)
#define MACSEC_MACSEC_EVER_TS3R(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_EVER_TS3R_SHIFT)) & MACSEC_MACSEC_EVER_TS3R_MASK)

#define MACSEC_MACSEC_EVER_TS2R_MASK             (0x20000000U)
#define MACSEC_MACSEC_EVER_TS2R_SHIFT            (29U)
#define MACSEC_MACSEC_EVER_TS2R_WIDTH            (1U)
#define MACSEC_MACSEC_EVER_TS2R(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_EVER_TS2R_SHIFT)) & MACSEC_MACSEC_EVER_TS2R_MASK)

