zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MACSEC.h
#define MACSEC_MACSEC_EVER_TS1R_MASK             (0x40000000U)
#define MACSEC_MACSEC_EVER_TS1R_SHIFT            (30U)
#define MACSEC_MACSEC_EVER_TS1R_WIDTH            (1U)
#define MACSEC_MACSEC_EVER_TS1R(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_EVER_TS1R_SHIFT)) & MACSEC_MACSEC_EVER_TS1R_MASK)

#define MACSEC_MACSEC_EVER_TS0R_MASK             (0x80000000U)
#define MACSEC_MACSEC_EVER_TS0R_SHIFT            (31U)
#define MACSEC_MACSEC_EVER_TS0R_WIDTH            (1U)
#define MACSEC_MACSEC_EVER_TS0R(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_EVER_TS0R_SHIFT)) & MACSEC_MACSEC_EVER_TS0R_MASK)
/*! @} */

/*! @name MACSEC_ERR - MACsec Error Register */
/*! @{ */

#define MACSEC_MACSEC_ERR_ECCE_MASK              (0x1U)
#define MACSEC_MACSEC_ERR_ECCE_SHIFT             (0U)
#define MACSEC_MACSEC_ERR_ECCE_WIDTH             (1U)
#define MACSEC_MACSEC_ERR_ECCE(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_ERR_ECCE_SHIFT)) & MACSEC_MACSEC_ERR_ECCE_MASK)

#define MACSEC_MACSEC_ERR_TS7E_MASK              (0x1000000U)
#define MACSEC_MACSEC_ERR_TS7E_SHIFT             (24U)
#define MACSEC_MACSEC_ERR_TS7E_WIDTH             (1U)
#define MACSEC_MACSEC_ERR_TS7E(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_ERR_TS7E_SHIFT)) & MACSEC_MACSEC_ERR_TS7E_MASK)

#define MACSEC_MACSEC_ERR_TS6E_MASK              (0x2000000U)
#define MACSEC_MACSEC_ERR_TS6E_SHIFT             (25U)
#define MACSEC_MACSEC_ERR_TS6E_WIDTH             (1U)
#define MACSEC_MACSEC_ERR_TS6E(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_ERR_TS6E_SHIFT)) & MACSEC_MACSEC_ERR_TS6E_MASK)

#define MACSEC_MACSEC_ERR_TS5E_MASK              (0x4000000U)
#define MACSEC_MACSEC_ERR_TS5E_SHIFT             (26U)
#define MACSEC_MACSEC_ERR_TS5E_WIDTH             (1U)
#define MACSEC_MACSEC_ERR_TS5E(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_ERR_TS5E_SHIFT)) & MACSEC_MACSEC_ERR_TS5E_MASK)

#define MACSEC_MACSEC_ERR_TS4E_MASK              (0x8000000U)
#define MACSEC_MACSEC_ERR_TS4E_SHIFT             (27U)
#define MACSEC_MACSEC_ERR_TS4E_WIDTH             (1U)
#define MACSEC_MACSEC_ERR_TS4E(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_ERR_TS4E_SHIFT)) & MACSEC_MACSEC_ERR_TS4E_MASK)

#define MACSEC_MACSEC_ERR_TS3E_MASK              (0x10000000U)
#define MACSEC_MACSEC_ERR_TS3E_SHIFT             (28U)
#define MACSEC_MACSEC_ERR_TS3E_WIDTH             (1U)
#define MACSEC_MACSEC_ERR_TS3E(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_ERR_TS3E_SHIFT)) & MACSEC_MACSEC_ERR_TS3E_MASK)

#define MACSEC_MACSEC_ERR_TS2E_MASK              (0x20000000U)
#define MACSEC_MACSEC_ERR_TS2E_SHIFT             (29U)
#define MACSEC_MACSEC_ERR_TS2E_WIDTH             (1U)
#define MACSEC_MACSEC_ERR_TS2E(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_ERR_TS2E_SHIFT)) & MACSEC_MACSEC_ERR_TS2E_MASK)

#define MACSEC_MACSEC_ERR_TS1E_MASK              (0x40000000U)
#define MACSEC_MACSEC_ERR_TS1E_SHIFT             (30U)
#define MACSEC_MACSEC_ERR_TS1E_WIDTH             (1U)
#define MACSEC_MACSEC_ERR_TS1E(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_ERR_TS1E_SHIFT)) & MACSEC_MACSEC_ERR_TS1E_MASK)

#define MACSEC_MACSEC_ERR_TS0E_MASK              (0x80000000U)
#define MACSEC_MACSEC_ERR_TS0E_SHIFT             (31U)
#define MACSEC_MACSEC_ERR_TS0E_WIDTH             (1U)
#define MACSEC_MACSEC_ERR_TS0E(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_ERR_TS0E_SHIFT)) & MACSEC_MACSEC_ERR_TS0E_MASK)
/*! @} */

/*! @name MACSEC_ERER - MACsec Error Enable Register */
/*! @{ */

#define MACSEC_MACSEC_ERER_ECCE_MASK             (0x1U)
#define MACSEC_MACSEC_ERER_ECCE_SHIFT            (0U)
#define MACSEC_MACSEC_ERER_ECCE_WIDTH            (1U)
#define MACSEC_MACSEC_ERER_ECCE(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_ERER_ECCE_SHIFT)) & MACSEC_MACSEC_ERER_ECCE_MASK)

#define MACSEC_MACSEC_ERER_TS7E_MASK             (0x1000000U)
#define MACSEC_MACSEC_ERER_TS7E_SHIFT            (24U)
#define MACSEC_MACSEC_ERER_TS7E_WIDTH            (1U)
#define MACSEC_MACSEC_ERER_TS7E(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_ERER_TS7E_SHIFT)) & MACSEC_MACSEC_ERER_TS7E_MASK)

#define MACSEC_MACSEC_ERER_TS6E_MASK             (0x2000000U)
#define MACSEC_MACSEC_ERER_TS6E_SHIFT            (25U)
#define MACSEC_MACSEC_ERER_TS6E_WIDTH            (1U)
#define MACSEC_MACSEC_ERER_TS6E(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_ERER_TS6E_SHIFT)) & MACSEC_MACSEC_ERER_TS6E_MASK)

#define MACSEC_MACSEC_ERER_TS5E_MASK             (0x4000000U)
#define MACSEC_MACSEC_ERER_TS5E_SHIFT            (26U)
#define MACSEC_MACSEC_ERER_TS5E_WIDTH            (1U)
#define MACSEC_MACSEC_ERER_TS5E(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_ERER_TS5E_SHIFT)) & MACSEC_MACSEC_ERER_TS5E_MASK)

#define MACSEC_MACSEC_ERER_TS4E_MASK             (0x8000000U)
#define MACSEC_MACSEC_ERER_TS4E_SHIFT            (27U)
#define MACSEC_MACSEC_ERER_TS4E_WIDTH            (1U)
#define MACSEC_MACSEC_ERER_TS4E(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_ERER_TS4E_SHIFT)) & MACSEC_MACSEC_ERER_TS4E_MASK)

#define MACSEC_MACSEC_ERER_TS3E_MASK             (0x10000000U)
#define MACSEC_MACSEC_ERER_TS3E_SHIFT            (28U)
#define MACSEC_MACSEC_ERER_TS3E_WIDTH            (1U)
#define MACSEC_MACSEC_ERER_TS3E(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_ERER_TS3E_SHIFT)) & MACSEC_MACSEC_ERER_TS3E_MASK)

#define MACSEC_MACSEC_ERER_TS2E_MASK             (0x20000000U)
#define MACSEC_MACSEC_ERER_TS2E_SHIFT            (29U)
#define MACSEC_MACSEC_ERER_TS2E_WIDTH            (1U)
#define MACSEC_MACSEC_ERER_TS2E(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_ERER_TS2E_SHIFT)) & MACSEC_MACSEC_ERER_TS2E_MASK)

#define MACSEC_MACSEC_ERER_TS1E_MASK             (0x40000000U)
#define MACSEC_MACSEC_ERER_TS1E_SHIFT            (30U)
#define MACSEC_MACSEC_ERER_TS1E_WIDTH            (1U)
#define MACSEC_MACSEC_ERER_TS1E(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_ERER_TS1E_SHIFT)) & MACSEC_MACSEC_ERER_TS1E_MASK)

