zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MACSEC.h
#define MACSEC_MACSEC_ERER_TS0E_MASK             (0x80000000U)
#define MACSEC_MACSEC_ERER_TS0E_SHIFT            (31U)
#define MACSEC_MACSEC_ERER_TS0E_WIDTH            (1U)
#define MACSEC_MACSEC_ERER_TS0E(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_ERER_TS0E_SHIFT)) & MACSEC_MACSEC_ERER_TS0E_MASK)
/*! @} */

/*! @name MACSEC_MEEC - MACsec Memory ECC Error Capture Register */
/*! @{ */

#define MACSEC_MACSEC_MEEC_MEMADDR_MASK          (0x3FFU)
#define MACSEC_MACSEC_MEEC_MEMADDR_SHIFT         (0U)
#define MACSEC_MACSEC_MEEC_MEMADDR_WIDTH         (10U)
#define MACSEC_MACSEC_MEEC_MEMADDR(x)            (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_MEEC_MEMADDR_SHIFT)) & MACSEC_MACSEC_MEEC_MEMADDR_MASK)

#define MACSEC_MACSEC_MEEC_SERCNT_MASK           (0xFF0000U)
#define MACSEC_MACSEC_MEEC_SERCNT_SHIFT          (16U)
#define MACSEC_MACSEC_MEEC_SERCNT_WIDTH          (8U)
#define MACSEC_MACSEC_MEEC_SERCNT(x)             (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_MEEC_SERCNT_SHIFT)) & MACSEC_MACSEC_MEEC_SERCNT_MASK)

#define MACSEC_MACSEC_MEEC_CET_MASK              (0x40000000U)
#define MACSEC_MACSEC_MEEC_CET_SHIFT             (30U)
#define MACSEC_MACSEC_MEEC_CET_WIDTH             (1U)
#define MACSEC_MACSEC_MEEC_CET(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_MEEC_CET_SHIFT)) & MACSEC_MACSEC_MEEC_CET_MASK)

#define MACSEC_MACSEC_MEEC_CAP_MASK              (0x80000000U)
#define MACSEC_MACSEC_MEEC_CAP_SHIFT             (31U)
#define MACSEC_MACSEC_MEEC_CAP_WIDTH             (1U)
#define MACSEC_MACSEC_MEEC_CAP(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_MEEC_CAP_SHIFT)) & MACSEC_MACSEC_MEEC_CAP_MASK)
/*! @} */

/*! @name MACSEC_STATUS - MACsec Idle status Register */
/*! @{ */

#define MACSEC_MACSEC_STATUS_I_MASK              (0x1U)
#define MACSEC_MACSEC_STATUS_I_SHIFT             (0U)
#define MACSEC_MACSEC_STATUS_I_WIDTH             (1U)
#define MACSEC_MACSEC_STATUS_I(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_STATUS_I_SHIFT)) & MACSEC_MACSEC_STATUS_I_MASK)
/*! @} */

/*! @name MACSEC_IFIOCP1HS - ifInOctetsCp first half Statistic */
/*! @{ */

#define MACSEC_MACSEC_IFIOCP1HS_ifInOctetsCp_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_IFIOCP1HS_ifInOctetsCp_SHIFT (0U)
#define MACSEC_MACSEC_IFIOCP1HS_ifInOctetsCp_WIDTH (32U)
#define MACSEC_MACSEC_IFIOCP1HS_ifInOctetsCp(x)  (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IFIOCP1HS_ifInOctetsCp_SHIFT)) & MACSEC_MACSEC_IFIOCP1HS_ifInOctetsCp_MASK)
/*! @} */

/*! @name MACSEC_IFIOCP2HS - ifInOctetsCp second half Statistic */
/*! @{ */

#define MACSEC_MACSEC_IFIOCP2HS_ifInOctetsCp_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_IFIOCP2HS_ifInOctetsCp_SHIFT (0U)
#define MACSEC_MACSEC_IFIOCP2HS_ifInOctetsCp_WIDTH (32U)
#define MACSEC_MACSEC_IFIOCP2HS_ifInOctetsCp(x)  (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IFIOCP2HS_ifInOctetsCp_SHIFT)) & MACSEC_MACSEC_IFIOCP2HS_ifInOctetsCp_MASK)
/*! @} */

/*! @name MACSEC_IFIUPCPS - ifInUcastPktsCp Statistic */
/*! @{ */

#define MACSEC_MACSEC_IFIUPCPS_ifInUcastPktsCp_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_IFIUPCPS_ifInUcastPktsCp_SHIFT (0U)
#define MACSEC_MACSEC_IFIUPCPS_ifInUcastPktsCp_WIDTH (32U)
#define MACSEC_MACSEC_IFIUPCPS_ifInUcastPktsCp(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IFIUPCPS_ifInUcastPktsCp_SHIFT)) & MACSEC_MACSEC_IFIUPCPS_ifInUcastPktsCp_MASK)
/*! @} */

/*! @name MACSEC_IFIOUP1HS - ifInOctetsUp first half Statistic */
/*! @{ */

#define MACSEC_MACSEC_IFIOUP1HS_ifInOctetsUp_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_IFIOUP1HS_ifInOctetsUp_SHIFT (0U)
#define MACSEC_MACSEC_IFIOUP1HS_ifInOctetsUp_WIDTH (32U)
#define MACSEC_MACSEC_IFIOUP1HS_ifInOctetsUp(x)  (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IFIOUP1HS_ifInOctetsUp_SHIFT)) & MACSEC_MACSEC_IFIOUP1HS_ifInOctetsUp_MASK)
/*! @} */

/*! @name MACSEC_IFIOUP2HS - ifInOctetsUp second half Statistic */
/*! @{ */

#define MACSEC_MACSEC_IFIOUP2HS_ifInOctetsUp_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_IFIOUP2HS_ifInOctetsUp_SHIFT (0U)
#define MACSEC_MACSEC_IFIOUP2HS_ifInOctetsUp_WIDTH (32U)
#define MACSEC_MACSEC_IFIOUP2HS_ifInOctetsUp(x)  (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IFIOUP2HS_ifInOctetsUp_SHIFT)) & MACSEC_MACSEC_IFIOUP2HS_ifInOctetsUp_MASK)
/*! @} */

/*! @name MACSEC_IFIUPUPS - ifInUcastPktsUp Statistic */
/*! @{ */

#define MACSEC_MACSEC_IFIUPUPS_ifInUcastPktsUp_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_IFIUPUPS_ifInUcastPktsUp_SHIFT (0U)
#define MACSEC_MACSEC_IFIUPUPS_ifInUcastPktsUp_WIDTH (32U)
#define MACSEC_MACSEC_IFIUPUPS_ifInUcastPktsUp(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IFIUPUPS_ifInUcastPktsUp_SHIFT)) & MACSEC_MACSEC_IFIUPUPS_ifInUcastPktsUp_MASK)
/*! @} */

/*! @name MACSEC_IFIMPCPS - ifInMulticastPktsCp Statistic */
/*! @{ */

#define MACSEC_MACSEC_IFIMPCPS_ifInMulticastPktsCp_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_IFIMPCPS_ifInMulticastPktsCp_SHIFT (0U)
#define MACSEC_MACSEC_IFIMPCPS_ifInMulticastPktsCp_WIDTH (32U)
#define MACSEC_MACSEC_IFIMPCPS_ifInMulticastPktsCp(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IFIMPCPS_ifInMulticastPktsCp_SHIFT)) & MACSEC_MACSEC_IFIMPCPS_ifInMulticastPktsCp_MASK)
/*! @} */

/*! @name MACSEC_IFIBPCPS - ifInBroadcastPktsCp Statistic */
/*! @{ */

#define MACSEC_MACSEC_IFIBPCPS_ifInBroadcastPktsCp_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_IFIBPCPS_ifInBroadcastPktsCp_SHIFT (0U)
#define MACSEC_MACSEC_IFIBPCPS_ifInBroadcastPktsCp_WIDTH (32U)
#define MACSEC_MACSEC_IFIBPCPS_ifInBroadcastPktsCp(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IFIBPCPS_ifInBroadcastPktsCp_SHIFT)) & MACSEC_MACSEC_IFIBPCPS_ifInBroadcastPktsCp_MASK)
/*! @} */

/*! @name MACSEC_IFIMPUPS - ifInMulticastPktsUp Statistic */
/*! @{ */

#define MACSEC_MACSEC_IFIMPUPS_ifInMulticastPktsUp_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_IFIMPUPS_ifInMulticastPktsUp_SHIFT (0U)
#define MACSEC_MACSEC_IFIMPUPS_ifInMulticastPktsUp_WIDTH (32U)
#define MACSEC_MACSEC_IFIMPUPS_ifInMulticastPktsUp(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IFIMPUPS_ifInMulticastPktsUp_SHIFT)) & MACSEC_MACSEC_IFIMPUPS_ifInMulticastPktsUp_MASK)
/*! @} */

