zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MACSEC.h
/*! @name MACSEC_IFIBPUPS - ifInBroadcastPktsUp Statistic */
/*! @{ */

#define MACSEC_MACSEC_IFIBPUPS_ifInBroadcastPktsUp_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_IFIBPUPS_ifInBroadcastPktsUp_SHIFT (0U)
#define MACSEC_MACSEC_IFIBPUPS_ifInBroadcastPktsUp_WIDTH (32U)
#define MACSEC_MACSEC_IFIBPUPS_ifInBroadcastPktsUp(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IFIBPUPS_ifInBroadcastPktsUp_SHIFT)) & MACSEC_MACSEC_IFIBPUPS_ifInBroadcastPktsUp_MASK)
/*! @} */

/*! @name MACSEC_INPWTS - InPktsWithoutTag Statistic */
/*! @{ */

#define MACSEC_MACSEC_INPWTS_InPktsWithoutTag_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_INPWTS_InPktsWithoutTag_SHIFT (0U)
#define MACSEC_MACSEC_INPWTS_InPktsWithoutTag_WIDTH (32U)
#define MACSEC_MACSEC_INPWTS_InPktsWithoutTag(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_INPWTS_InPktsWithoutTag_SHIFT)) & MACSEC_MACSEC_INPWTS_InPktsWithoutTag_MASK)
/*! @} */

/*! @name MACSEC_INPKAYS - InPktsKaY Statistic */
/*! @{ */

#define MACSEC_MACSEC_INPKAYS_InPktsKaY_MASK     (0xFFFFFFFFU)
#define MACSEC_MACSEC_INPKAYS_InPktsKaY_SHIFT    (0U)
#define MACSEC_MACSEC_INPKAYS_InPktsKaY_WIDTH    (32U)
#define MACSEC_MACSEC_INPKAYS_InPktsKaY(x)       (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_INPKAYS_InPktsKaY_SHIFT)) & MACSEC_MACSEC_INPKAYS_InPktsKaY_MASK)
/*! @} */

/*! @name MACSEC_INPBTS - InPktsBadTag Statistic */
/*! @{ */

#define MACSEC_MACSEC_INPBTS_InPktsBadTag_MASK   (0xFFFFFFFFU)
#define MACSEC_MACSEC_INPBTS_InPktsBadTag_SHIFT  (0U)
#define MACSEC_MACSEC_INPBTS_InPktsBadTag_WIDTH  (32U)
#define MACSEC_MACSEC_INPBTS_InPktsBadTag(x)     (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_INPBTS_InPktsBadTag_SHIFT)) & MACSEC_MACSEC_INPBTS_InPktsBadTag_MASK)
/*! @} */

/*! @name MACSEC_IPSNFS - InPktsSCINotFound Statistic */
/*! @{ */

#define MACSEC_MACSEC_IPSNFS_InPktsSCINotFound_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_IPSNFS_InPktsSCINotFound_SHIFT (0U)
#define MACSEC_MACSEC_IPSNFS_InPktsSCINotFound_WIDTH (32U)
#define MACSEC_MACSEC_IPSNFS_InPktsSCINotFound(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IPSNFS_InPktsSCINotFound_SHIFT)) & MACSEC_MACSEC_IPSNFS_InPktsSCINotFound_MASK)
/*! @} */

/*! @name MACSEC_IPUECS - InPktsUnsupportedEC Statistic */
/*! @{ */

#define MACSEC_MACSEC_IPUECS_InPktsUnsupportedEC_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_IPUECS_InPktsUnsupportedEC_SHIFT (0U)
#define MACSEC_MACSEC_IPUECS_InPktsUnsupportedEC_WIDTH (32U)
#define MACSEC_MACSEC_IPUECS_InPktsUnsupportedEC(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IPUECS_InPktsUnsupportedEC_SHIFT)) & MACSEC_MACSEC_IPUECS_InPktsUnsupportedEC_MASK)
/*! @} */

/*! @name MACSEC_IPESCBS - nPktsEponSingleCopyBroadcast Statistic */
/*! @{ */

#define MACSEC_MACSEC_IPESCBS_InPktsEponSingleCopyBroadcast_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_IPESCBS_InPktsEponSingleCopyBroadcast_SHIFT (0U)
#define MACSEC_MACSEC_IPESCBS_InPktsEponSingleCopyBroadcast_WIDTH (32U)
#define MACSEC_MACSEC_IPESCBS_InPktsEponSingleCopyBroadcast(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IPESCBS_InPktsEponSingleCopyBroadcast_SHIFT)) & MACSEC_MACSEC_IPESCBS_InPktsEponSingleCopyBroadcast_MASK)
/*! @} */

/*! @name MACSEC_IPTLS - InPktsTooLong Statistic */
/*! @{ */

#define MACSEC_MACSEC_IPTLS_InPktsTooLong_MASK   (0xFFFFFFFFU)
#define MACSEC_MACSEC_IPTLS_InPktsTooLong_SHIFT  (0U)
#define MACSEC_MACSEC_IPTLS_InPktsTooLong_WIDTH  (32U)
#define MACSEC_MACSEC_IPTLS_InPktsTooLong(x)     (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IPTLS_InPktsTooLong_SHIFT)) & MACSEC_MACSEC_IPTLS_InPktsTooLong_MASK)
/*! @} */

/*! @name MACSEC_IPFUS - InPktsFilteredUp Statistic */
/*! @{ */

#define MACSEC_MACSEC_IPFUS_InPktsFilteredUp_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_IPFUS_InPktsFilteredUp_SHIFT (0U)
#define MACSEC_MACSEC_IPFUS_InPktsFilteredUp_WIDTH (32U)
#define MACSEC_MACSEC_IPFUS_InPktsFilteredUp(x)  (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IPFUS_InPktsFilteredUp_SHIFT)) & MACSEC_MACSEC_IPFUS_InPktsFilteredUp_MASK)
/*! @} */

/*! @name MACSEC_IPDUS - InPktsDiscardedUp Statistic */
/*! @{ */

#define MACSEC_MACSEC_IPDUS_InPktsDiscardedUp_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_IPDUS_InPktsDiscardedUp_SHIFT (0U)
#define MACSEC_MACSEC_IPDUS_InPktsDiscardedUp_WIDTH (32U)
#define MACSEC_MACSEC_IPDUS_InPktsDiscardedUp(x) (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_IPDUS_InPktsDiscardedUp_SHIFT)) & MACSEC_MACSEC_IPDUS_InPktsDiscardedUp_MASK)
/*! @} */

/*! @name MACSEC_OPDS - OutPktsDiscarded Statistic */
/*! @{ */

#define MACSEC_MACSEC_OPDS_OutPktsDiscarded_MASK (0xFFFFFFFFU)
#define MACSEC_MACSEC_OPDS_OutPktsDiscarded_SHIFT (0U)
#define MACSEC_MACSEC_OPDS_OutPktsDiscarded_WIDTH (32U)
#define MACSEC_MACSEC_OPDS_OutPktsDiscarded(x)   (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_OPDS_OutPktsDiscarded_SHIFT)) & MACSEC_MACSEC_OPDS_OutPktsDiscarded_MASK)
/*! @} */

/*! @name MACSEC_RXSAASSCI - RX Security Association A Short Secure Channel Identifier */
/*! @{ */

#define MACSEC_MACSEC_RXSAASSCI_RXSSCI_MASK      (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSAASSCI_RXSSCI_SHIFT     (0U)
#define MACSEC_MACSEC_RXSAASSCI_RXSSCI_WIDTH     (32U)
#define MACSEC_MACSEC_RXSAASSCI_RXSSCI(x)        (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSAASSCI_RXSSCI_SHIFT)) & MACSEC_MACSEC_RXSAASSCI_RXSSCI_MASK)
/*! @} */

/*! @name MACSEC_RXSAASALT1T - RX Security Association A SALT 1 of 3 */
/*! @{ */

#define MACSEC_MACSEC_RXSAASALT1T_RXSALT_MASK    (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSAASALT1T_RXSALT_SHIFT   (0U)
#define MACSEC_MACSEC_RXSAASALT1T_RXSALT_WIDTH   (32U)
#define MACSEC_MACSEC_RXSAASALT1T_RXSALT(x)      (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSAASALT1T_RXSALT_SHIFT)) & MACSEC_MACSEC_RXSAASALT1T_RXSALT_MASK)
/*! @} */

/*! @name MACSEC_RXSAASALT2T - RX Security Association A SALT 2 of 3 */
/*! @{ */

#define MACSEC_MACSEC_RXSAASALT2T_RXSALT_MASK    (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSAASALT2T_RXSALT_SHIFT   (0U)
#define MACSEC_MACSEC_RXSAASALT2T_RXSALT_WIDTH   (32U)
#define MACSEC_MACSEC_RXSAASALT2T_RXSALT(x)      (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSAASALT2T_RXSALT_SHIFT)) & MACSEC_MACSEC_RXSAASALT2T_RXSALT_MASK)
/*! @} */

/*! @name MACSEC_RXSAASALT3T - RX Security Association A SALT 3 of 3 */
/*! @{ */

