zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MACSEC.h
#define MACSEC_MACSEC_RXSAASALT3T_RXSALT_MASK    (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSAASALT3T_RXSALT_SHIFT   (0U)
#define MACSEC_MACSEC_RXSAASALT3T_RXSALT_WIDTH   (32U)
#define MACSEC_MACSEC_RXSAASALT3T_RXSALT(x)      (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSAASALT3T_RXSALT_SHIFT)) & MACSEC_MACSEC_RXSAASALT3T_RXSALT_MASK)
/*! @} */

/*! @name MACSEC_RXSABSSCI - RX Security Association B Short Secure Channel Identifier */
/*! @{ */

#define MACSEC_MACSEC_RXSABSSCI_RXSSCI_MASK      (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSABSSCI_RXSSCI_SHIFT     (0U)
#define MACSEC_MACSEC_RXSABSSCI_RXSSCI_WIDTH     (32U)
#define MACSEC_MACSEC_RXSABSSCI_RXSSCI(x)        (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSABSSCI_RXSSCI_SHIFT)) & MACSEC_MACSEC_RXSABSSCI_RXSSCI_MASK)
/*! @} */

/*! @name MACSEC_RXSABSALT1T - RX Security Association B SALT 1 of 3 */
/*! @{ */

#define MACSEC_MACSEC_RXSABSALT1T_RXSALT_MASK    (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSABSALT1T_RXSALT_SHIFT   (0U)
#define MACSEC_MACSEC_RXSABSALT1T_RXSALT_WIDTH   (32U)
#define MACSEC_MACSEC_RXSABSALT1T_RXSALT(x)      (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSABSALT1T_RXSALT_SHIFT)) & MACSEC_MACSEC_RXSABSALT1T_RXSALT_MASK)
/*! @} */

/*! @name MACSEC_RXSABSALT2T - RX Security Association B SALT 2 of 3 */
/*! @{ */

#define MACSEC_MACSEC_RXSABSALT2T_RXSALT_MASK    (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSABSALT2T_RXSALT_SHIFT   (0U)
#define MACSEC_MACSEC_RXSABSALT2T_RXSALT_WIDTH   (32U)
#define MACSEC_MACSEC_RXSABSALT2T_RXSALT(x)      (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSABSALT2T_RXSALT_SHIFT)) & MACSEC_MACSEC_RXSABSALT2T_RXSALT_MASK)
/*! @} */

/*! @name MACSEC_RXSABSALT3T - RX Security Association B SALT 3 of 3 */
/*! @{ */

#define MACSEC_MACSEC_RXSABSALT3T_RXSALT_MASK    (0xFFFFFFFFU)
#define MACSEC_MACSEC_RXSABSALT3T_RXSALT_SHIFT   (0U)
#define MACSEC_MACSEC_RXSABSALT3T_RXSALT_WIDTH   (32U)
#define MACSEC_MACSEC_RXSABSALT3T_RXSALT(x)      (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_RXSABSALT3T_RXSALT_SHIFT)) & MACSEC_MACSEC_RXSABSALT3T_RXSALT_MASK)
/*! @} */

/*! @name MACSEC_TXSAASSCI - TX Security Association A Short Secure Channel Identifier */
/*! @{ */

#define MACSEC_MACSEC_TXSAASSCI_TXSSCI_MASK      (0xFFFFFFFFU)
#define MACSEC_MACSEC_TXSAASSCI_TXSSCI_SHIFT     (0U)
#define MACSEC_MACSEC_TXSAASSCI_TXSSCI_WIDTH     (32U)
#define MACSEC_MACSEC_TXSAASSCI_TXSSCI(x)        (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSAASSCI_TXSSCI_SHIFT)) & MACSEC_MACSEC_TXSAASSCI_TXSSCI_MASK)
/*! @} */

/*! @name MACSEC_TXSAASALT1T - TX Security Association A SALT 1 of 3 */
/*! @{ */

#define MACSEC_MACSEC_TXSAASALT1T_TXSALT_MASK    (0xFFFFFFFFU)
#define MACSEC_MACSEC_TXSAASALT1T_TXSALT_SHIFT   (0U)
#define MACSEC_MACSEC_TXSAASALT1T_TXSALT_WIDTH   (32U)
#define MACSEC_MACSEC_TXSAASALT1T_TXSALT(x)      (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSAASALT1T_TXSALT_SHIFT)) & MACSEC_MACSEC_TXSAASALT1T_TXSALT_MASK)
/*! @} */

/*! @name MACSEC_TXSAASALT2T - TX Security Association A SALT 2 of 3 */
/*! @{ */

#define MACSEC_MACSEC_TXSAASALT2T_TXSALT_MASK    (0xFFFFFFFFU)
#define MACSEC_MACSEC_TXSAASALT2T_TXSALT_SHIFT   (0U)
#define MACSEC_MACSEC_TXSAASALT2T_TXSALT_WIDTH   (32U)
#define MACSEC_MACSEC_TXSAASALT2T_TXSALT(x)      (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSAASALT2T_TXSALT_SHIFT)) & MACSEC_MACSEC_TXSAASALT2T_TXSALT_MASK)
/*! @} */

/*! @name MACSEC_TXSAASALT3T - TX Security Association A SALT 3 of 3 */
/*! @{ */

#define MACSEC_MACSEC_TXSAASALT3T_TXSALT_MASK    (0xFFFFFFFFU)
#define MACSEC_MACSEC_TXSAASALT3T_TXSALT_SHIFT   (0U)
#define MACSEC_MACSEC_TXSAASALT3T_TXSALT_WIDTH   (32U)
#define MACSEC_MACSEC_TXSAASALT3T_TXSALT(x)      (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSAASALT3T_TXSALT_SHIFT)) & MACSEC_MACSEC_TXSAASALT3T_TXSALT_MASK)
/*! @} */

/*! @name MACSEC_TXSABSSCI - TX Security Association B Short Secure Channel Identifier */
/*! @{ */

#define MACSEC_MACSEC_TXSABSSCI_TXSSCI_MASK      (0xFFFFFFFFU)
#define MACSEC_MACSEC_TXSABSSCI_TXSSCI_SHIFT     (0U)
#define MACSEC_MACSEC_TXSABSSCI_TXSSCI_WIDTH     (32U)
#define MACSEC_MACSEC_TXSABSSCI_TXSSCI(x)        (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSABSSCI_TXSSCI_SHIFT)) & MACSEC_MACSEC_TXSABSSCI_TXSSCI_MASK)
/*! @} */

/*! @name MACSEC_TXSABSALT1T - TX Security Association B SALT 1 of 3 */
/*! @{ */

#define MACSEC_MACSEC_TXSABSALT1T_TXSALT_MASK    (0xFFFFFFFFU)
#define MACSEC_MACSEC_TXSABSALT1T_TXSALT_SHIFT   (0U)
#define MACSEC_MACSEC_TXSABSALT1T_TXSALT_WIDTH   (32U)
#define MACSEC_MACSEC_TXSABSALT1T_TXSALT(x)      (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSABSALT1T_TXSALT_SHIFT)) & MACSEC_MACSEC_TXSABSALT1T_TXSALT_MASK)
/*! @} */

/*! @name MACSEC_TXSABSALT2T - TX Security Association B SALT 2 of 3 */
/*! @{ */

#define MACSEC_MACSEC_TXSABSALT2T_TXSALT_MASK    (0xFFFFFFFFU)
#define MACSEC_MACSEC_TXSABSALT2T_TXSALT_SHIFT   (0U)
#define MACSEC_MACSEC_TXSABSALT2T_TXSALT_WIDTH   (32U)
#define MACSEC_MACSEC_TXSABSALT2T_TXSALT(x)      (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSABSALT2T_TXSALT_SHIFT)) & MACSEC_MACSEC_TXSABSALT2T_TXSALT_MASK)
/*! @} */

/*! @name MACSEC_TXSABSALT3T - TX Security Association B SALT 3 of 3 */
/*! @{ */

#define MACSEC_MACSEC_TXSABSALT3T_TXSALT_MASK    (0xFFFFFFFFU)
#define MACSEC_MACSEC_TXSABSALT3T_TXSALT_SHIFT   (0U)
#define MACSEC_MACSEC_TXSABSALT3T_TXSALT_WIDTH   (32U)
#define MACSEC_MACSEC_TXSABSALT3T_TXSALT(x)      (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSABSALT3T_TXSALT_SHIFT)) & MACSEC_MACSEC_TXSABSALT3T_TXSALT_MASK)
/*! @} */

/*! @name MACSEC_TXSCSR0P0 - TX SC Selection Record 0 part 0 */
/*! @{ */

#define MACSEC_MACSEC_TXSCSR0P0_MAC_DA_MASK      (0xFFFFFFFFU)
#define MACSEC_MACSEC_TXSCSR0P0_MAC_DA_SHIFT     (0U)
#define MACSEC_MACSEC_TXSCSR0P0_MAC_DA_WIDTH     (32U)
#define MACSEC_MACSEC_TXSCSR0P0_MAC_DA(x)        (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR0P0_MAC_DA_SHIFT)) & MACSEC_MACSEC_TXSCSR0P0_MAC_DA_MASK)
/*! @} */

/*! @name MACSEC_TXSCSR0P1 - TX SC Selection Record 0 part 1 */
/*! @{ */

#define MACSEC_MACSEC_TXSCSR0P1_MAC_SA_MASK      (0xFFFFU)
#define MACSEC_MACSEC_TXSCSR0P1_MAC_SA_SHIFT     (0U)
#define MACSEC_MACSEC_TXSCSR0P1_MAC_SA_WIDTH     (16U)
#define MACSEC_MACSEC_TXSCSR0P1_MAC_SA(x)        (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR0P1_MAC_SA_SHIFT)) & MACSEC_MACSEC_TXSCSR0P1_MAC_SA_MASK)

#define MACSEC_MACSEC_TXSCSR0P1_MAC_DA_MASK      (0xFFFF0000U)
#define MACSEC_MACSEC_TXSCSR0P1_MAC_DA_SHIFT     (16U)
#define MACSEC_MACSEC_TXSCSR0P1_MAC_DA_WIDTH     (16U)
#define MACSEC_MACSEC_TXSCSR0P1_MAC_DA(x)        (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR0P1_MAC_DA_SHIFT)) & MACSEC_MACSEC_TXSCSR0P1_MAC_DA_MASK)
/*! @} */

/*! @name MACSEC_TXSCSR0P2 - TX SC Selection Record 0 part 2 */
/*! @{ */

#define MACSEC_MACSEC_TXSCSR0P2_MAC_SA_MASK      (0xFFFFFFFFU)
#define MACSEC_MACSEC_TXSCSR0P2_MAC_SA_SHIFT     (0U)
#define MACSEC_MACSEC_TXSCSR0P2_MAC_SA_WIDTH     (32U)
#define MACSEC_MACSEC_TXSCSR0P2_MAC_SA(x)        (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR0P2_MAC_SA_SHIFT)) & MACSEC_MACSEC_TXSCSR0P2_MAC_SA_MASK)
/*! @} */

/*! @name MACSEC_TXSCSR0P3 - TX SC Selection Record 0 part 3 */
/*! @{ */

