zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MACSEC.h
#define MACSEC_MACSEC_TXSCSR1P3_UVV_MASK         (0x2000U)
#define MACSEC_MACSEC_TXSCSR1P3_UVV_SHIFT        (13U)
#define MACSEC_MACSEC_TXSCSR1P3_UVV_WIDTH        (1U)
#define MACSEC_MACSEC_TXSCSR1P3_UVV(x)           (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR1P3_UVV_SHIFT)) & MACSEC_MACSEC_TXSCSR1P3_UVV_MASK)

#define MACSEC_MACSEC_TXSCSR1P3_USA_MASK         (0x4000U)
#define MACSEC_MACSEC_TXSCSR1P3_USA_SHIFT        (14U)
#define MACSEC_MACSEC_TXSCSR1P3_USA_WIDTH        (1U)
#define MACSEC_MACSEC_TXSCSR1P3_USA(x)           (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR1P3_USA_SHIFT)) & MACSEC_MACSEC_TXSCSR1P3_USA_MASK)

#define MACSEC_MACSEC_TXSCSR1P3_UDA_MASK         (0x8000U)
#define MACSEC_MACSEC_TXSCSR1P3_UDA_SHIFT        (15U)
#define MACSEC_MACSEC_TXSCSR1P3_UDA_WIDTH        (1U)
#define MACSEC_MACSEC_TXSCSR1P3_UDA(x)           (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR1P3_UDA_SHIFT)) & MACSEC_MACSEC_TXSCSR1P3_UDA_MASK)

#define MACSEC_MACSEC_TXSCSR1P3_VID_MASK         (0xFFF0000U)
#define MACSEC_MACSEC_TXSCSR1P3_VID_SHIFT        (16U)
#define MACSEC_MACSEC_TXSCSR1P3_VID_WIDTH        (12U)
#define MACSEC_MACSEC_TXSCSR1P3_VID(x)           (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR1P3_VID_SHIFT)) & MACSEC_MACSEC_TXSCSR1P3_VID_MASK)

#define MACSEC_MACSEC_TXSCSR1P3_DEI_MASK         (0x10000000U)
#define MACSEC_MACSEC_TXSCSR1P3_DEI_SHIFT        (28U)
#define MACSEC_MACSEC_TXSCSR1P3_DEI_WIDTH        (1U)
#define MACSEC_MACSEC_TXSCSR1P3_DEI(x)           (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR1P3_DEI_SHIFT)) & MACSEC_MACSEC_TXSCSR1P3_DEI_MASK)

#define MACSEC_MACSEC_TXSCSR1P3_PCP_MASK         (0xE0000000U)
#define MACSEC_MACSEC_TXSCSR1P3_PCP_SHIFT        (29U)
#define MACSEC_MACSEC_TXSCSR1P3_PCP_WIDTH        (3U)
#define MACSEC_MACSEC_TXSCSR1P3_PCP(x)           (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR1P3_PCP_SHIFT)) & MACSEC_MACSEC_TXSCSR1P3_PCP_MASK)
/*! @} */

/*! @name MACSEC_TXSCSR2P0 - TX SC Selection Record 2 part 0 */
/*! @{ */

#define MACSEC_MACSEC_TXSCSR2P0_MAC_DA_MASK      (0xFFFFFFFFU)
#define MACSEC_MACSEC_TXSCSR2P0_MAC_DA_SHIFT     (0U)
#define MACSEC_MACSEC_TXSCSR2P0_MAC_DA_WIDTH     (32U)
#define MACSEC_MACSEC_TXSCSR2P0_MAC_DA(x)        (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR2P0_MAC_DA_SHIFT)) & MACSEC_MACSEC_TXSCSR2P0_MAC_DA_MASK)
/*! @} */

/*! @name MACSEC_TXSCSR2P1 - TX SC Selection Record 2 part 1 */
/*! @{ */

#define MACSEC_MACSEC_TXSCSR2P1_MAC_SA_MASK      (0xFFFFU)
#define MACSEC_MACSEC_TXSCSR2P1_MAC_SA_SHIFT     (0U)
#define MACSEC_MACSEC_TXSCSR2P1_MAC_SA_WIDTH     (16U)
#define MACSEC_MACSEC_TXSCSR2P1_MAC_SA(x)        (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR2P1_MAC_SA_SHIFT)) & MACSEC_MACSEC_TXSCSR2P1_MAC_SA_MASK)

#define MACSEC_MACSEC_TXSCSR2P1_MAC_DA_MASK      (0xFFFF0000U)
#define MACSEC_MACSEC_TXSCSR2P1_MAC_DA_SHIFT     (16U)
#define MACSEC_MACSEC_TXSCSR2P1_MAC_DA_WIDTH     (16U)
#define MACSEC_MACSEC_TXSCSR2P1_MAC_DA(x)        (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR2P1_MAC_DA_SHIFT)) & MACSEC_MACSEC_TXSCSR2P1_MAC_DA_MASK)
/*! @} */

/*! @name MACSEC_TXSCSR2P2 - TX SC Selection Record 2 part 2 */
/*! @{ */

#define MACSEC_MACSEC_TXSCSR2P2_MAC_SA_MASK      (0xFFFFFFFFU)
#define MACSEC_MACSEC_TXSCSR2P2_MAC_SA_SHIFT     (0U)
#define MACSEC_MACSEC_TXSCSR2P2_MAC_SA_WIDTH     (32U)
#define MACSEC_MACSEC_TXSCSR2P2_MAC_SA(x)        (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR2P2_MAC_SA_SHIFT)) & MACSEC_MACSEC_TXSCSR2P2_MAC_SA_MASK)
/*! @} */

/*! @name MACSEC_TXSCSR2P3 - TX SC Selection Record 2 part 3 */
/*! @{ */

#define MACSEC_MACSEC_TXSCSR2P3_TX_SC_MASK       (0x1FU)
#define MACSEC_MACSEC_TXSCSR2P3_TX_SC_SHIFT      (0U)
#define MACSEC_MACSEC_TXSCSR2P3_TX_SC_WIDTH      (5U)
#define MACSEC_MACSEC_TXSCSR2P3_TX_SC(x)         (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR2P3_TX_SC_SHIFT)) & MACSEC_MACSEC_TXSCSR2P3_TX_SC_MASK)

#define MACSEC_MACSEC_TXSCSR2P3_EN_MASK          (0x100U)
#define MACSEC_MACSEC_TXSCSR2P3_EN_SHIFT         (8U)
#define MACSEC_MACSEC_TXSCSR2P3_EN_WIDTH         (1U)
#define MACSEC_MACSEC_TXSCSR2P3_EN(x)            (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR2P3_EN_SHIFT)) & MACSEC_MACSEC_TXSCSR2P3_EN_MASK)

#define MACSEC_MACSEC_TXSCSR2P3_UVD_MASK         (0x800U)
#define MACSEC_MACSEC_TXSCSR2P3_UVD_SHIFT        (11U)
#define MACSEC_MACSEC_TXSCSR2P3_UVD_WIDTH        (1U)
#define MACSEC_MACSEC_TXSCSR2P3_UVD(x)           (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR2P3_UVD_SHIFT)) & MACSEC_MACSEC_TXSCSR2P3_UVD_MASK)

#define MACSEC_MACSEC_TXSCSR2P3_UVP_MASK         (0x1000U)
#define MACSEC_MACSEC_TXSCSR2P3_UVP_SHIFT        (12U)
#define MACSEC_MACSEC_TXSCSR2P3_UVP_WIDTH        (1U)
#define MACSEC_MACSEC_TXSCSR2P3_UVP(x)           (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR2P3_UVP_SHIFT)) & MACSEC_MACSEC_TXSCSR2P3_UVP_MASK)

#define MACSEC_MACSEC_TXSCSR2P3_UVV_MASK         (0x2000U)
#define MACSEC_MACSEC_TXSCSR2P3_UVV_SHIFT        (13U)
#define MACSEC_MACSEC_TXSCSR2P3_UVV_WIDTH        (1U)
#define MACSEC_MACSEC_TXSCSR2P3_UVV(x)           (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR2P3_UVV_SHIFT)) & MACSEC_MACSEC_TXSCSR2P3_UVV_MASK)

#define MACSEC_MACSEC_TXSCSR2P3_USA_MASK         (0x4000U)
#define MACSEC_MACSEC_TXSCSR2P3_USA_SHIFT        (14U)
#define MACSEC_MACSEC_TXSCSR2P3_USA_WIDTH        (1U)
#define MACSEC_MACSEC_TXSCSR2P3_USA(x)           (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR2P3_USA_SHIFT)) & MACSEC_MACSEC_TXSCSR2P3_USA_MASK)

#define MACSEC_MACSEC_TXSCSR2P3_UDA_MASK         (0x8000U)
#define MACSEC_MACSEC_TXSCSR2P3_UDA_SHIFT        (15U)
#define MACSEC_MACSEC_TXSCSR2P3_UDA_WIDTH        (1U)
#define MACSEC_MACSEC_TXSCSR2P3_UDA(x)           (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR2P3_UDA_SHIFT)) & MACSEC_MACSEC_TXSCSR2P3_UDA_MASK)

#define MACSEC_MACSEC_TXSCSR2P3_VID_MASK         (0xFFF0000U)
#define MACSEC_MACSEC_TXSCSR2P3_VID_SHIFT        (16U)
#define MACSEC_MACSEC_TXSCSR2P3_VID_WIDTH        (12U)
#define MACSEC_MACSEC_TXSCSR2P3_VID(x)           (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR2P3_VID_SHIFT)) & MACSEC_MACSEC_TXSCSR2P3_VID_MASK)

#define MACSEC_MACSEC_TXSCSR2P3_DEI_MASK         (0x10000000U)
#define MACSEC_MACSEC_TXSCSR2P3_DEI_SHIFT        (28U)
#define MACSEC_MACSEC_TXSCSR2P3_DEI_WIDTH        (1U)
#define MACSEC_MACSEC_TXSCSR2P3_DEI(x)           (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR2P3_DEI_SHIFT)) & MACSEC_MACSEC_TXSCSR2P3_DEI_MASK)

#define MACSEC_MACSEC_TXSCSR2P3_PCP_MASK         (0xE0000000U)
#define MACSEC_MACSEC_TXSCSR2P3_PCP_SHIFT        (29U)
#define MACSEC_MACSEC_TXSCSR2P3_PCP_WIDTH        (3U)
#define MACSEC_MACSEC_TXSCSR2P3_PCP(x)           (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_TXSCSR2P3_PCP_SHIFT)) & MACSEC_MACSEC_TXSCSR2P3_PCP_MASK)
/*! @} */

/*! @name MACSEC_TXSCSR3P0 - TX SC Selection Record 3 part 0 */
/*! @{ */

