zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MACSEC.h
#define MACSEC_MACSEC_UPFR6M1_OVP_MASK           (0x1000U)
#define MACSEC_MACSEC_UPFR6M1_OVP_SHIFT          (12U)
#define MACSEC_MACSEC_UPFR6M1_OVP_WIDTH          (1U)
#define MACSEC_MACSEC_UPFR6M1_OVP(x)             (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_UPFR6M1_OVP_SHIFT)) & MACSEC_MACSEC_UPFR6M1_OVP_MASK)

#define MACSEC_MACSEC_UPFR6M1_MAC_DA_MASK        (0xFFFF0000U)
#define MACSEC_MACSEC_UPFR6M1_MAC_DA_SHIFT       (16U)
#define MACSEC_MACSEC_UPFR6M1_MAC_DA_WIDTH       (16U)
#define MACSEC_MACSEC_UPFR6M1_MAC_DA(x)          (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_UPFR6M1_MAC_DA_SHIFT)) & MACSEC_MACSEC_UPFR6M1_MAC_DA_MASK)
/*! @} */

/*! @name MACSEC_UPFR6M2 - Uncontrolled Port filter Record 6 mask part 2 */
/*! @{ */

#define MACSEC_MACSEC_UPFR6M2_ETYPE_MASK         (0xFFFFU)
#define MACSEC_MACSEC_UPFR6M2_ETYPE_SHIFT        (0U)
#define MACSEC_MACSEC_UPFR6M2_ETYPE_WIDTH        (16U)
#define MACSEC_MACSEC_UPFR6M2_ETYPE(x)           (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_UPFR6M2_ETYPE_SHIFT)) & MACSEC_MACSEC_UPFR6M2_ETYPE_MASK)
/*! @} */

/*! @name MACSEC_UPFR6R - Uncontrolled Port filter Record 6 Result */
/*! @{ */

#define MACSEC_MACSEC_UPFR6R_EN_MASK             (0x1U)
#define MACSEC_MACSEC_UPFR6R_EN_SHIFT            (0U)
#define MACSEC_MACSEC_UPFR6R_EN_WIDTH            (1U)
#define MACSEC_MACSEC_UPFR6R_EN(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_UPFR6R_EN_SHIFT)) & MACSEC_MACSEC_UPFR6R_EN_MASK)

#define MACSEC_MACSEC_UPFR6R_A_MASK              (0x100U)
#define MACSEC_MACSEC_UPFR6R_A_SHIFT             (8U)
#define MACSEC_MACSEC_UPFR6R_A_WIDTH             (1U)
#define MACSEC_MACSEC_UPFR6R_A(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_UPFR6R_A_SHIFT)) & MACSEC_MACSEC_UPFR6R_A_MASK)
/*! @} */

/*! @name MACSEC_UPFR7D0 - Uncontrolled Port filter Record 7 data part 0 */
/*! @{ */

#define MACSEC_MACSEC_UPFR7D0_MAC_DA_MASK        (0xFFFFFFFFU)
#define MACSEC_MACSEC_UPFR7D0_MAC_DA_SHIFT       (0U)
#define MACSEC_MACSEC_UPFR7D0_MAC_DA_WIDTH       (32U)
#define MACSEC_MACSEC_UPFR7D0_MAC_DA(x)          (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_UPFR7D0_MAC_DA_SHIFT)) & MACSEC_MACSEC_UPFR7D0_MAC_DA_MASK)
/*! @} */

/*! @name MACSEC_UPFR7D1 - Uncontrolled Port filter Record 7 data part 1 */
/*! @{ */

#define MACSEC_MACSEC_UPFR7D1_VID_MASK           (0xFFFU)
#define MACSEC_MACSEC_UPFR7D1_VID_SHIFT          (0U)
#define MACSEC_MACSEC_UPFR7D1_VID_WIDTH          (12U)
#define MACSEC_MACSEC_UPFR7D1_VID(x)             (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_UPFR7D1_VID_SHIFT)) & MACSEC_MACSEC_UPFR7D1_VID_MASK)

#define MACSEC_MACSEC_UPFR7D1_OVP_MASK           (0x1000U)
#define MACSEC_MACSEC_UPFR7D1_OVP_SHIFT          (12U)
#define MACSEC_MACSEC_UPFR7D1_OVP_WIDTH          (1U)
#define MACSEC_MACSEC_UPFR7D1_OVP(x)             (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_UPFR7D1_OVP_SHIFT)) & MACSEC_MACSEC_UPFR7D1_OVP_MASK)

#define MACSEC_MACSEC_UPFR7D1_MAC_DA_MASK        (0xFFFF0000U)
#define MACSEC_MACSEC_UPFR7D1_MAC_DA_SHIFT       (16U)
#define MACSEC_MACSEC_UPFR7D1_MAC_DA_WIDTH       (16U)
#define MACSEC_MACSEC_UPFR7D1_MAC_DA(x)          (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_UPFR7D1_MAC_DA_SHIFT)) & MACSEC_MACSEC_UPFR7D1_MAC_DA_MASK)
/*! @} */

/*! @name MACSEC_UPFR7D2 - Uncontrolled Port filter Record 7 data part 2 */
/*! @{ */

#define MACSEC_MACSEC_UPFR7D2_ETYPE_MASK         (0xFFFFU)
#define MACSEC_MACSEC_UPFR7D2_ETYPE_SHIFT        (0U)
#define MACSEC_MACSEC_UPFR7D2_ETYPE_WIDTH        (16U)
#define MACSEC_MACSEC_UPFR7D2_ETYPE(x)           (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_UPFR7D2_ETYPE_SHIFT)) & MACSEC_MACSEC_UPFR7D2_ETYPE_MASK)
/*! @} */

/*! @name MACSEC_UPFR7M0 - Uncontrolled Port filter Record 7 mask part 0 */
/*! @{ */

#define MACSEC_MACSEC_UPFR7M0_MAC_DA_MASK        (0xFFFFFFFFU)
#define MACSEC_MACSEC_UPFR7M0_MAC_DA_SHIFT       (0U)
#define MACSEC_MACSEC_UPFR7M0_MAC_DA_WIDTH       (32U)
#define MACSEC_MACSEC_UPFR7M0_MAC_DA(x)          (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_UPFR7M0_MAC_DA_SHIFT)) & MACSEC_MACSEC_UPFR7M0_MAC_DA_MASK)
/*! @} */

/*! @name MACSEC_UPFR7M1 - Uncontrolled Port filter Record 7 mask part 1 */
/*! @{ */

#define MACSEC_MACSEC_UPFR7M1_VID_MASK           (0xFFFU)
#define MACSEC_MACSEC_UPFR7M1_VID_SHIFT          (0U)
#define MACSEC_MACSEC_UPFR7M1_VID_WIDTH          (12U)
#define MACSEC_MACSEC_UPFR7M1_VID(x)             (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_UPFR7M1_VID_SHIFT)) & MACSEC_MACSEC_UPFR7M1_VID_MASK)

#define MACSEC_MACSEC_UPFR7M1_OVP_MASK           (0x1000U)
#define MACSEC_MACSEC_UPFR7M1_OVP_SHIFT          (12U)
#define MACSEC_MACSEC_UPFR7M1_OVP_WIDTH          (1U)
#define MACSEC_MACSEC_UPFR7M1_OVP(x)             (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_UPFR7M1_OVP_SHIFT)) & MACSEC_MACSEC_UPFR7M1_OVP_MASK)

#define MACSEC_MACSEC_UPFR7M1_MAC_DA_MASK        (0xFFFF0000U)
#define MACSEC_MACSEC_UPFR7M1_MAC_DA_SHIFT       (16U)
#define MACSEC_MACSEC_UPFR7M1_MAC_DA_WIDTH       (16U)
#define MACSEC_MACSEC_UPFR7M1_MAC_DA(x)          (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_UPFR7M1_MAC_DA_SHIFT)) & MACSEC_MACSEC_UPFR7M1_MAC_DA_MASK)
/*! @} */

/*! @name MACSEC_UPFR7M2 - Uncontrolled Port filter Record 7 mask part 2 */
/*! @{ */

#define MACSEC_MACSEC_UPFR7M2_ETYPE_MASK         (0xFFFFU)
#define MACSEC_MACSEC_UPFR7M2_ETYPE_SHIFT        (0U)
#define MACSEC_MACSEC_UPFR7M2_ETYPE_WIDTH        (16U)
#define MACSEC_MACSEC_UPFR7M2_ETYPE(x)           (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_UPFR7M2_ETYPE_SHIFT)) & MACSEC_MACSEC_UPFR7M2_ETYPE_MASK)
/*! @} */

/*! @name MACSEC_UPFR7R - Uncontrolled Port filter Record 7 Result */
/*! @{ */

#define MACSEC_MACSEC_UPFR7R_EN_MASK             (0x1U)
#define MACSEC_MACSEC_UPFR7R_EN_SHIFT            (0U)
#define MACSEC_MACSEC_UPFR7R_EN_WIDTH            (1U)
#define MACSEC_MACSEC_UPFR7R_EN(x)               (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_UPFR7R_EN_SHIFT)) & MACSEC_MACSEC_UPFR7R_EN_MASK)

#define MACSEC_MACSEC_UPFR7R_A_MASK              (0x100U)
#define MACSEC_MACSEC_UPFR7R_A_SHIFT             (8U)
#define MACSEC_MACSEC_UPFR7R_A_WIDTH             (1U)
#define MACSEC_MACSEC_UPFR7R_A(x)                (((uint32_t)(((uint32_t)(x)) << MACSEC_MACSEC_UPFR7R_A_SHIFT)) & MACSEC_MACSEC_UPFR7R_A_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group MACSEC_Register_Masks */

/*!
 * @}
 */ /* end of group MACSEC_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_MACSEC_H_) */
